{"id":1518,"date":"2013-04-18T18:40:56","date_gmt":"2013-04-18T14:40:56","guid":{"rendered":"http:\/\/abap-blog.ru\/?p=1518"},"modified":"2021-03-02T10:05:19","modified_gmt":"2021-03-02T06:05:19","slug":"potoki-i-lokatory","status":"publish","type":"post","link":"https:\/\/abap-blog.ru\/database-work\/potoki-i-lokatory\/","title":{"rendered":"Потоки и локаторы"},"content":{"rendered":"<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/04\/database-219x218.png\"><img loading=\"lazy\" class=\"size-full wp-image-1526 alignleft\" style=\"margin: 10px;\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/04\/database-219x218.png\" alt=\"database-219x218\" width=\"219\" height=\"218\" \/><\/a><\/p>\n<p>Начиная с версии 7.0, EhP2 в ABAP была введена новая концепция обработки внутренних (внешних) данных &#8212; потоковая обработка данных.<\/p>\n<p>Поток – ссылка на последовательный набор записей данных, чей конец может быть не известен. Потоки разделяются по виду: потоки данных и фильтрующие потоки.<\/p>\n<p>Фильтрующие потоки в настоящее время не реализованы и не рассматриваются в данной статье.<\/p>\n<p>Потоки данных – такие потоки, которые напрямую соединены как читающий поток к источнику данных или как записывающий поток к приемнику данных.<\/p>\n<p><b>Читающий поток<\/b> (входящий поток) – любой поток данных, присоединенный к источнику данных. В качестве читающего потока может выступать фильтрующий поток, присоединенный к читающему потоку. Направление читающего потока всегда исходит от источника данных (например, от поля таблицы базы данных к объекту представляющему поток), через читающий поток нельзя записывать данные.<\/p>\n<p>Источник данных – хранилище, из которого происходит получение данных читающим потоком. Источником может быть LOB поле в базе данных, файл, строка или внутренняя таблица. В настоящее время чтение доступно для полей из таблиц баз данных (LOB поля), строк и внутренних таблиц.<\/p>\n<p><!--more--><\/p>\n<p>LOB – Large object, может быть двух видов: BLOB или CLOB. BLOB – Binary large object. Поле в таблице базы данных с типом данных RAWSTRING. CLOB – Character large object. Поле в таблице базы данных с типом данных STRING.<\/p>\n<p><b>Записывающий поток<\/b>  (исходящий поток) – любой поток данных, присоединенный к приемнику данных. В качестве записывающего потока может выступать фильтрующий поток, присоединенный к записывающему потоку. Направление записывающего потока всегда направлено к приемнику данных, т.о. записывающий поток используется только для записи.<\/p>\n<p>Приемник данных – хранилище, в котором записывающий поток сохраняет свои данные. В качестве приемника может быть LOB поле в базе данных, файл, строка или внутренняя таблица. В настоящее время запись реализована для полей таблиц БД, строк и внутренних таблиц.<\/p>\n<p>Потоки данных всегда имеют одно направление – на чтение или на запись.<\/p>\n<p>Кроме направления потоки данных могут иметь следующие типы: бинарный поток, символьный поток. Бинарный поток содержит данные с байтовым типом данных (x, xstring), родовой тип xsequence (для полей таблиц RAWSTRING). Символьный поток содержит данные с символьным типом данных (с, string).<\/p>\n<p>В ABAP, потоки представлены в виде инстанций специального набора классов, передача (получение) данных осуществляется с помощью вызова соответствующих методов.<\/p>\n<p>Свойства потоков:<\/p>\n<ul>\n<li><b>Вид потока <\/b>– поток данных или фильтрующий поток<\/li>\n<li><b>Направление потока<\/b> – на чтение или на запись<\/li>\n<li><b>Тип потока<\/b> – символьный поток или бинарный поток.<\/li>\n<\/ul>\n<p>Классы и интерфейсы, реализующие в ABAP концепцию потоков, лежат в пакете SABP_STREAMS_AND_LOCATORS. Следующая диаграмма демонстрирует основные классы и интерфейсы:<\/p>\n<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/04\/streams.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-1519\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/04\/streams.png\" alt=\"Управление потоками\" width=\"654\" height=\"503\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p>Классы для работы с потоками данных начинаются с «CL_ABAP_» и содержат следующие идентификаторы:<\/p>\n<ul>\n<li>Resource – источник для чтения или приемник для записи, в настоящее время поддерживаются: строки (STRING), LOB поля в БД (DB), внутренние таблицы (ITAB).<\/li>\n<li>Type – тип потока, бинарный (X) и строковый (C).<\/li>\n<li>Direction – направление потока, запись (WRITER) и чтение (READER).<\/li>\n<\/ul>\n<p>Имена классов для фильтрующих потоков начинаются с «CL_ABAP_FILTER_» и именуются по тем же правилам. В настоящее время фильтрующие потоки не реализованы (Версия 7.02-7.31).<\/p>\n<p>Основные методы, используемые для работы с потоками, описаны в интерфейсах и суперклассах как методы ядра (для просмотра можно воспользоваться программой RSKMETH), следовательно, их реализация обеспечивается средой выполнения ABAP. Основные методы при работе с потоками:<\/p>\n<ul>\n<li>DATA_AVAILABLE возвращает X если еще есть несчитанные данные.<\/li>\n<li>IS_X_READER возвращает X если является бинарным потоком.<\/li>\n<li>READ возвращает строку с заданным числом байтов или символов из потока.<\/li>\n<li>SKIP пропускает заданное количество байт или символов в потоке.<\/li>\n<li>WRITE запись данных потока в приемник.<\/li>\n<li>CLOSE закрывает поток (после чего читать или писать уже нельзя).<\/li>\n<li>IS_CLOSED возвращает X если поток закрыт.<\/li>\n<li>SET_MARK установить метку, к которой можно будет возвратиться позже.<\/li>\n<li>IS_MARK_SUPPORTED возвращает X если метки поддерживаются.<\/li>\n<li>RESET_TO_MARK возврат к метке.<\/li>\n<\/ul>\n<h3>Потоки к строкам<\/h3>\n<p>Для создания потоков, источником или приемником которых служат строки, используется следующий набор классов:<\/p>\n<ul>\n<li>CL_ABAP_STRING_C_READER<\/li>\n<li>CL_ABAP_STRING_C_WRITER<\/li>\n<li>CL_ABAP_STRING_X_READER<\/li>\n<li>CL_ABAP_STRING_X_WRITER<\/li>\n<\/ul>\n<p>Данные классы являются потомками от абстрактных классов потоков внутренних данных &#8212; CL_ABAP_MEMORY_&#8230;.<\/p>\n<p>Пример программы с потоками для строк:<\/p>\n<pre class=\"lang:abap decode:true\">DATA: string_writer TYPE REF TO cl_abap_string_c_writer,\r\n      string_reader TYPE REF TO if_abap_c_reader.\r\n\r\nDATA snippet TYPE c LENGTH 1.\r\n\r\nCREATE OBJECT string_writer TYPE cl_abap_string_c_writer.\r\n\r\nDO 10 TIMES.\r\n  string_writer-&gt;write( |{ sy-index - 1 }| ).\r\nENDDO.\r\n\r\nstring_writer-&gt;close( ).\r\n\r\nCREATE OBJECT string_reader TYPE cl_abap_string_c_reader\r\n  EXPORTING\r\n    str = string_writer-&gt;get_result_string( ).\r\n\r\nstring_reader-&gt;skip( 3 ).\r\nWHILE string_reader-&gt;data_available( ) = 'X'.\r\n  snippet = string_reader-&gt;read( 1 ).\r\n  WRITE \/ snippet.\r\nENDWHILE.\r\nstring_reader-&gt;close( ).<\/pre>\n<h3>Потоки к внутренним таблицам<\/h3>\n<p>Для создания потоков, источником или приемником данных для которых служат внутренние таблицы, используется следующий набор классов:<\/p>\n<ul>\n<li>CL_ABAP_ITAB_C_READER<\/li>\n<li>CL_ABAP_ITAB_C_WRITER<\/li>\n<li>CL_ABAP_ITAB_X_READER<\/li>\n<li>CL_ABAP_ITAB_X_WRITER<\/li>\n<\/ul>\n<p>Данные классы являются потомками от абстрактных классов потоков внутренних данных &#8212; CL_ABAP_MEMORY_&#8230;.<\/p>\n<p>Пример программы с потоками для внутренних таблиц:<\/p>\n<pre class=\"lang:abap decode:true\">DATA:  itab TYPE TABLE OF string,\r\n       text TYPE string.\r\n\r\nDATA itab_reader TYPE REF TO if_abap_c_reader.\r\n\r\nAPPEND `abc` TO itab.\r\nAPPEND `def` TO itab.\r\nAPPEND `ghi` TO itab.\r\n\r\nCREATE OBJECT itab_reader TYPE cl_abap_itab_c_reader\r\n  EXPORTING\r\n    itab = itab.\r\n\r\nWHILE itab_reader-&gt;data_available( ) = 'X'.\r\n  text = itab_reader-&gt;read( 3 ).\r\n  WRITE \/ text.\r\nENDWHILE.\r\nitab_reader-&gt;close( ).<\/pre>\n<h3>Обработка LOB полей базы данных<\/h3>\n<p>Обработка LOB полей БД возможна с помощью потоков и локаторов, при этом есть следующие особенности их использования:<\/p>\n<p>Локаторы:<\/p>\n<ul>\n<li>Связываются с LOB полями для чтения или записи через LOB дескрипторы, запись подразумевает копирование данных из других локаторов, возможности прямой записи из переменных ABAP программы через локатор в базу данных не существует (для этого используются записывающие потоки).<\/li>\n<li>Имеют доступ к вложенным последовательностям в LOB полях и их свойствам<\/li>\n<li>Позволяют копировать LOB поля, без переноса данных на сервер приложений<\/li>\n<li>За счёт обработки на стороне СУБД повышается и нагрузка на неё<\/li>\n<li>Для тех СУБД, где нет поддержки локаторов, она эмулируется на сервере приложений.<\/li>\n<\/ul>\n<p>Потоки:<\/p>\n<ul>\n<li>Связываются, как и локаторы через LOB дескрипторы<\/li>\n<li>Данные LOB полей обрабатываются последовательно, используя методы потоков<\/li>\n<li>Не нагружают дополнительно СУБД.<\/li>\n<\/ul>\n<p>Количество LOB дескрипторов на один DB LUW ограничено 1000. Открытых потоков может быть не более 16.<\/p>\n<p>Пример копирования через локатор LOB поля, без переноса его содержимого на сервер приложений:<\/p>\n<pre class=\"lang:abap decode:true\">DATA: \r\n  locator TYPE REF TO cl_abap_db_c_locator.    \r\n\r\nSELECT SINGLE longtext FROM lob_table                           \r\n  INTO locator     \" &lt;- Получить дескриптор (указатель) на LOB поле\r\n    WHERE key = key1.    \r\n\r\nUPDATE lob_table       \r\n  SET longtext = locator  \" &lt;- Скопировать LOB поле с помощью локатора в другую таблицу\r\n    WHERE key    = key2.    \r\n\r\nlocator-&gt;close( ).  \" Необходимо позаботиться о закрытии локатора<\/pre>\n<p>Пример считывания из БД с помощью потока:<\/p>\n<pre class=\"lang:abap decode:true\">DATA:\r\n  reader TYPE REF TO cl_abap_db_x_reader.\r\n\r\nSELECT SINGLE picture FROM demo_blob_table\r\n  INTO reader \" &lt;- Получение LOB дескриптора для потока\r\n    WHERE name = pic_name.\r\n\r\n...\r\n\r\nWHILE reader-&gt;data_available( ) = 'X'.  \" &lt;- Чтение данных из потока в файл\r\n  TRANSFER reader-&gt;read( len ) TO pict_file.\r\nENDWHILE.\r\n\r\nreader-&gt;close( ).<\/pre>\n<p>Под LOB дескрипторами понимаются интерфейсы IF_ABAP_DB_LOB_HANDLE (*_BLOB_HANDLE, *_CLOB_HANDLE) и классы которые их внедряют. В примерах описанных выше используются классы, которые создаются и привязываются к LOB полю через дополнение INTO. Кроме того вместе классов можно использовать интерфейсы и дополнение CREATING в SQL операторе SELECT, для того чтобы создавать объекты в зависимости от типов полей, пример использования:<\/p>\n<pre class=\"lang:abap decode:true\">DATA:\r\n  locator TYPE REF TO if_abap_db_lob_handle.\r\n\r\nSELECT SINGLE description\r\n  FROM zhd_tasks\r\n    INTO locator     \" &lt;- Получить дескриптор (указатель) на LOB поле\r\n      CREATING LOCATOR FOR COLUMNS description\r\n        WHERE task = 761.<\/pre>\n<p>В данном случае создается локатор для поля description. В зависимости от вида поля (BLOB или CLOB) создается экземпляр определенного класса (CL_ABAP_DB_C_LOCATOR или CL_ABAP_DB_X_LOCATOR). Данное дополнение можно использовать и динамически, по тем же правилам что и в других ABAP командах: CREATING… (текст команды создания). Ключевое слово LOCATOR (READER) определяет, какой объект мы создаем. Дополнение [ALL [OTHER] [BLOB|CLOB]] COLUMNS [blob1 blob2 &#8230; clob1 clob2 &#8230;] используется тогда, когда выбор происходит в структуру (таблицу).<\/p>\n<p>В случае считывания структуры (таблицы), а не единичного поля, необходимо объявлять специальную LOB структуру. LOB структура представляет собой специальную рабочую область с теми же полями что и внутри таблицы БД, однако должен быть объявлен хотя бы один компонент с привязкой к LOB полю. Компонент представляет из себя ссылочную переменную, указывающую на LOB дескриптор (интерфейс или класс). Когда объявляется LOB структура, компоненты связанные с LOB полем, заменяются на соответствующий интерфейс (класс).<\/p>\n<p>Объявление LOB структуры происходит следующим способом:<\/p>\n<p>TYPES dtype TYPE dbtab <a>lob_handle_type<\/a> FOR <a>lob_handle_columns<\/a> <b><br \/>\n[<a>lob_handle_type<\/a> FOR <a>lob_handle_columns<\/a><br \/>\n&#8230;                                   ].<\/b><\/p>\n<p>В <b>dbtab<\/b> должна быть указана база данных или ракурс из словаря. Поле lob_handle_type определяет тип LOB дескриптора:<\/p>\n<p>&#8230; { READER|LOCATOR|{LOB HANDLE} } <b><br \/>\n| { WRITER|LOCATOR } &#8230;<\/b><\/p>\n<p>READER определяет поля с типами:<\/p>\n<ul>\n<li>CL_ABAP_DB_X_READER для BLOB<\/li>\n<li>CL_ABAP_DB_C_READER для CLOB<\/li>\n<\/ul>\n<p>WRITER определяет поля с типами:<\/p>\n<ul>\n<li>CL_ABAP_DB_X_WRITER для BLOB<\/li>\n<li>CL_ABAP_DB_C_WRITER для CLOB<\/li>\n<\/ul>\n<p>LOCATOR определяет поля с типами:<\/p>\n<ul>\n<li>CL_ABAP_DB_X_LOCATOR для BLOB<\/li>\n<li>CL_ABAP_DB_C_LOCATOR для CLOB<\/li>\n<\/ul>\n<p>LOB HANDLE определяет поля с типами:<\/p>\n<ul>\n<li>IF_ABAP_DB_BLOB_HANDLE для BLOB<\/li>\n<li>IF_ABAP_DB_CLOB_HANDLE для CLOB<\/li>\n<\/ul>\n<p>Дополнения READER и WRITER нельзя указывать вместе. Дополнение WRITER так же не может быть использовано с дополнением LOB HANDLE.<\/p>\n<p>Дополнение lob_handle_columns определяет, какие поля из таблицы БД мы будем использовать как LOB поля.<\/p>\n<p>Синтаксис следующий:<\/p>\n<p>&#8230; { COLUMNS blob1 blob2 &#8230; clob1 clob2 &#8230; } <b><br \/>\n<\/b>    | { ALL [OTHER] [BLOB|CLOB] COLUMNS } &#8230;<\/p>\n<ul>\n<li>COLUMNS – определяет индивидуальный перечень полей<\/li>\n<li>ALL OTHER BLOB|CLOB COLUMNS – включает остальные BLOB|CLOB поля не перечисленные при индивидуальном определении<\/li>\n<li>ALL BLOB|CLOB COLUMNS – включает все BLOB|CLOB поля таблицы<\/li>\n<li>ALL OTHER COLUMNS – включает все поля (BLOB и CLOB) не перечисленные в индивидуальном определении<\/li>\n<li>ALL COLUMNS – включает все CLOB и BLOB поля из таблицы<\/li>\n<\/ul>\n<p>Программа, демонстрирующая объявление LOB структур:<\/p>\n<pre class=\"lang:abap decode:true\">CLASS demo_lob_handles DEFINITION.\r\n  PUBLIC SECTION.\r\n    CLASS-METHODS main.\r\n\r\n    TYPES:\r\n\r\n      lob_handle_structure_1 TYPE demo_lob_table\r\n                             READER      FOR COLUMNS clob1 blob1,\r\n\r\n      lob_handle_structure_2 TYPE demo_lob_table\r\n                             LOB HANDLE  FOR ALL COLUMNS,\r\n\r\n      lob_handle_structure_3 TYPE demo_lob_table\r\n                             LOCATOR     FOR ALL BLOB COLUMNS\r\n                             WRITER      FOR ALL CLOB COLUMNS,\r\n\r\n      lob_handle_structure_4 TYPE demo_lob_table\r\n                             READER      FOR COLUMNS clob1 clob2\r\n                             LOB HANDLE  FOR ALL BLOB COLUMNS\r\n                             LOCATOR     FOR ALL OTHER CLOB COLUMNS,\r\n\r\n      lob_handle_structure_5 TYPE demo_lob_table\r\n                             READER      FOR COLUMNS blob1 blob2 blob3\r\n                             LOCATOR     FOR COLUMNS clob1 clob2 clob3\r\n                             LOB HANDLE  FOR ALL OTHER COLUMNS,\r\n\r\n      lob_handle_structure_6 TYPE demo_lob_table\r\n                             READER      FOR COLUMNS blob1\r\n                             LOCATOR     FOR COLUMNS blob2\r\n                             LOB HANDLE  FOR COLUMNS blob3\r\n                             LOB HANDLE  FOR ALL CLOB COLUMNS.\r\n\r\n  PRIVATE SECTION.\r\n    CLASS-METHODS type_output IMPORTING struct TYPE string.\r\nENDCLASS.\r\n\r\nCLASS demo_lob_handles IMPLEMENTATION.\r\n  METHOD main.\r\n    type_output( 'LOB_HANDLE_STRUCTURE_1' ).\r\n    type_output( 'LOB_HANDLE_STRUCTURE_2' ).\r\n    type_output( 'LOB_HANDLE_STRUCTURE_3' ).\r\n    type_output( 'LOB_HANDLE_STRUCTURE_4' ).\r\n    type_output( 'LOB_HANDLE_STRUCTURE_5' ).\r\n    type_output( 'LOB_HANDLE_STRUCTURE_6' ).\r\n  ENDMETHOD.\r\n  METHOD type_output.\r\n    DATA structdescr TYPE REF TO cl_abap_structdescr.\r\n    DATA components TYPE abap_compdescr_tab.\r\n    DATA component  LIKE LINE OF components.\r\n    DATA typedescr   TYPE REF TO cl_abap_typedescr.\r\n    DATA refdescr    TYPE REF TO cl_abap_refdescr.\r\n    DATA name       TYPE string.\r\n    structdescr ?= cl_abap_structdescr=&gt;describe_by_name( struct ).\r\n    components = structdescr-&gt;components.\r\n    WRITE (47) struct COLOR 1 INTENSIFIED OFF.\r\n    LOOP AT components INTO component.\r\n      TRY.\r\n          name = struct &amp;&amp; '-' &amp;&amp; component-name.\r\n          refdescr ?= cl_abap_typedescr=&gt;describe_by_name( name ).\r\n          typedescr = refdescr-&gt;get_referenced_type( ).\r\n          WRITE: \/(6)  component-name\r\n                       COLOR 1 INTENSIFIED OFF,\r\n                  (40) typedescr-&gt;absolute_name\r\n                       COLOR 2 INTENSIFIED OFF.\r\n        CATCH cx_sy_move_cast_error.\r\n      ENDTRY.\r\n    ENDLOOP.\r\n    SKIP.\r\n  ENDMETHOD.\r\nENDCLASS.\r\n\r\nSTART-OF-SELECTION.\r\n  demo_lob_handles=&gt;main( ).<\/pre>\n<p>Кроме выше указанного способа LOB структуры могут быть объявлены в словаре или через BEGIN OF…END OF. Для более подробной информации рекомендую ознакомиться с документацией в ABAP (ссылки ниже).<\/p>\n<h3>Использование потоков в OpenSQL командах<\/h3>\n<p>Потоки могут быть следующих видов:<\/p>\n<ul>\n<li>CL_ABAP_DB_C_READER – для чтения данных из СLOB полей<\/li>\n<li>CL_ABAP_DB_X_READER – для чтения данных из BLOB полей<\/li>\n<li>CL_ABAP_DB_C_WRITER – для записи данных в СLOB поля<\/li>\n<li>CL_ABAP_DB_X_WRITER – для записи данных в BLOB поля<\/li>\n<\/ul>\n<p>Основные методы при работе с потоками обработки LOB полей такие же, как и для других потоков (см. выше). В зависимости от направления потока различается и их процесс создания. Как было видно в примере выше, потоки для чтения LOB полей создаются автоматически через атрибут INTO оператора SELECT или через дополнение CREATING.<\/p>\n<p>Создание записывающих потоков происходит с помощью операторов: INSERT, UPDATE, MODIFY. В зависимости от СУБД, обработка записывающих потоков может отличаться:<\/p>\n<ul>\n<li>В MaxDB или Oracle компоненты, которые не являются LOB дескрипторами, записываются сразу после выполнения команд обновления. Если обновление не может быть выполнено, в соответствующие поля (sy-subrc, sy-dbcnt) записываются коды ошибок и число обработанных записей, при этом записывающие потоки не создаются. Если обновление может быть выполнено, создаются записывающие потоки, при этом перенос данных из них происходит в момент, когда последний из них будет закрыт.<\/li>\n<li>В других СУБД компоненты, не являющиеся LOB дескрипторами, не переносятся в БД сразу же после операторов обновления. При этом записывающие потоки всегда создаются. Данные переносятся в БД только тогда, когда будет закрыт последний записывающий поток, открытый для этого оператора. Соответственно между выполнением оператора и закрытием последнего записывающего потока, статус операции является неопределенным. В поле sy-subrc после оператора будет записан код ошибки 2, а в sy-dbcnt значение -1. Перед закрытием потока необходимо получить указатель на объект класса CL_ABAP_SQL_CHANGING_STMNT, через интерфейс IF_ABAP_DB_WRITER используя метод GET_STATEMENT_HANDLE. С помощью метода GET_STATE данного класса можно получить статус OSQL операции, а с помощью метода GET_DB_COUNT количество обработанных записей. Кроме того с помощью данного объекта можно закрыть все открытые для записи потоки. Если операция не может быть выполнена (например, есть дубликаты в ключевых полях), система выдаст исключения CX_STREAM_IO_EXCEPTION или CX_CLOSE_RESOURCE_ERROR.<\/li>\n<\/ul>\n<p>Записывающий поток будет открытым до тех пор, пока не будет выполнена отмена изменений через ROLLBACK, либо закрыт явным образом через метод CLOSE. В случае выполнения COMMIT WORK при открытых записывающих потоках, система вызовет динамическую ошибку &#8212; COMMIT_STREAM_ERROR.<\/p>\n<p>Читающие потоки закрываются неявным способом в циклическом операторе SELECT после оператора ENDSELECT, а так же после окончания DB LUW.<\/p>\n<p>Пример программы, заполняющей LOB поле через записывающий поток:<\/p>\n<pre class=\"lang:abap decode:true\">PARAMETERS name TYPE c LENGTH 255 LOWER CASE\r\n           DEFAULT '\/SAP\/PUBLIC\/BC\/ABAP\/Sources\/ABAP_Docu_Logo.gif'.\r\n\r\nCLASS demo DEFINITION.\r\n  PUBLIC SECTION.\r\n    CLASS-METHODS:  class_constructor,\r\n                    main.\r\n  PRIVATE SECTION.\r\n    TYPES: pict_line(1022) TYPE x,\r\n           pict_tab TYPE STANDARD TABLE OF pict_line .\r\n    CLASS-DATA pict TYPE pict_tab.\r\n    CLASS-METHODS get_pict_tab\r\n     IMPORTING\r\n       mime_url TYPE csequence\r\n     EXPORTING\r\n       pict_tab TYPE STANDARD TABLE.\r\nENDCLASS.\r\n\r\nCLASS demo IMPLEMENTATION.\r\n\r\n  METHOD main.\r\n\r\n    DATA: xline TYPE xstring,\r\n          \" Объявляем LOB структуру с потоком на запись к полю picture\r\n          wa    TYPE demo_blob_table WRITER FOR COLUMNS picture,\r\n          stmnt TYPE REF TO cl_abap_sql_changing_stmnt,\r\n          subrc TYPE sy-subrc.\r\n\r\n    TRY.\r\n        wa-name = name.\r\n        \" Вставляем новую запись в таблицу, при этом создается записывающий поток\r\n        INSERT demo_blob_table FROM wa.\r\n        IF sy-subrc = 4.\r\n          subrc = 4.\r\n        ELSE.\r\n          \" Получаем ссылку на CL_ABAP_SQL_CHANGING_STMNT,\r\n          \" с помощью данного класса мы можем определить корректность обработки потока\r\n          stmnt = wa-picture-&gt;get_statement_handle( ).\r\n          \" Записываем построчно считанные с MIME репозитария данные\r\n          LOOP AT pict INTO xline.\r\n            wa-picture-&gt;write( xline ).\r\n          ENDLOOP.\r\n          \" Обязательно закрываем поток\r\n          wa-picture-&gt;close( ).\r\n          \" Проверяем кол-во обработанных записей в таблице\r\n          IF stmnt-&gt;get_db_count( ) &lt;&gt; 1.\r\n            subrc = 4.\r\n          ENDIF.\r\n\r\n        ENDIF.\r\n      CATCH cx_stream_io_exception cx_close_resource_error.\r\n        subrc = 4.\r\n    ENDTRY.\r\n\r\n    IF subrc = 0.\r\n      MESSAGE 'One line inserted, you can run DEMO_DB_READER now'\r\n              TYPE 'S'.\r\n    ELSE.\r\n      MESSAGE 'Error during insertion' TYPE 'S' DISPLAY LIKE 'E'.\r\n    ENDIF.\r\n\r\n  ENDMETHOD.\r\n\r\n  METHOD class_constructor.\r\n    get_pict_tab(\r\n     EXPORTING\r\n       mime_url = name\r\n     IMPORTING\r\n       pict_tab = pict ).\r\n\r\n     \" Удалим запись с таким же именем.\r\n     DELETE FROM demo_blob_table WHERE name = name.\r\n  ENDMETHOD.\r\n\r\n  METHOD get_pict_tab.\r\n    DATA pict_wa   TYPE xstring.\r\n    DATA length   TYPE i.\r\n    DATA mime_api TYPE REF TO if_mr_api.\r\n    mime_api = cl_mime_repository_api=&gt;get_api( ).\r\n    mime_api-&gt;get( EXPORTING i_url = mime_url\r\n                   IMPORTING e_content = pict_wa\r\n                   EXCEPTIONS OTHERS = 4 ).\r\n    IF sy-subrc = 4.\r\n      RETURN.\r\n    ENDIF.\r\n    CLEAR pict_tab.\r\n    length = xstrlen( pict_wa ).\r\n    WHILE length &gt;= 1022.\r\n      APPEND pict_wa(1022) TO pict_tab.\r\n      SHIFT pict_wa BY 1022 PLACES LEFT IN BYTE MODE.\r\n      length = xstrlen( pict_wa ).\r\n    ENDWHILE.\r\n    IF length &gt; 0.\r\n      APPEND pict_wa TO pict_tab.\r\n    ENDIF.\r\n  ENDMETHOD.\r\n\r\nENDCLASS.\r\n\r\nSTART-OF-SELECTION.\r\n  demo=&gt;main( ).<\/pre>\n<p>Программа, считывающая записанные выше данные:<\/p>\n<pre class=\"lang:abap decode:true\">REPORT demo_db_reader.\r\n\r\nPARAMETERS name TYPE c LENGTH 255 LOWER CASE\r\n           DEFAULT '\/SAP\/PUBLIC\/BC\/ABAP\/Sources\/ABAP_Docu_Logo.gif'.\r\n\r\nCLASS demo DEFINITION.\r\n  PUBLIC SECTION.\r\n    CLASS-METHODS main.\r\n  PRIVATE SECTION.\r\n    TYPES: pict_line(1022) TYPE x,\r\n           pict_tab TYPE STANDARD TABLE OF pict_line .\r\n    CLASS-DATA pict TYPE pict_tab.\r\n    CLASS-METHODS show_picture.\r\nENDCLASS.\r\n\r\nCLASS demo IMPLEMENTATION.\r\n  METHOD main.\r\n\r\n    DATA reader TYPE REF TO cl_abap_db_x_reader.\r\n\r\n    SELECT SINGLE picture\r\n           FROM demo_blob_table\r\n           INTO reader\r\n           WHERE name = name.\r\n\r\n    IF sy-subrc &lt;&gt; 0.\r\n      MESSAGE 'Nothing found, run DEMO_DB_WRITER first!'\r\n              TYPE 'S' DISPLAY LIKE 'E'.\r\n      RETURN.\r\n    ENDIF.\r\n\r\n    WHILE reader-&gt;data_available( ) = 'X'.\r\n      APPEND reader-&gt;read( 1022 ) TO pict.\r\n    ENDWHILE.\r\n\r\n    reader-&gt;close( ).\r\n\r\n    show_picture( ).\r\n\r\n  ENDMETHOD.\r\n  METHOD show_picture.\r\n    DATA html_str TYPE string.\r\n    DATA ext_data   TYPE cl_abap_browser=&gt;load_tab.\r\n    DATA ext_line   TYPE cl_abap_browser=&gt;load_tab_line.\r\n    html_str = '&lt;html&gt;&lt;body&gt;&lt;img src=\"PICT.GIF\" &gt;&lt;\/body&gt;&lt;\/html&gt;'.\r\n    ext_line-name = 'PICT.GIF'.\r\n    ext_line-type = 'image'.\r\n    GET REFERENCE OF pict INTO ext_line-dref.\r\n    APPEND ext_line TO ext_data.\r\n    cl_abap_browser=&gt;show_html(\r\n      EXPORTING\r\n        html_string = html_str\r\n        format      = cl_abap_browser=&gt;landscape\r\n        size        = cl_abap_browser=&gt;small\r\n        data_table  = ext_data\r\n        check_html  = ' ' ).\r\n  ENDMETHOD.\r\nENDCLASS.\r\n\r\nSTART-OF-SELECTION.\r\n  demo=&gt;main( ).<\/pre>\n<h3>Использование локаторов в OpenSQL<\/h3>\n<p>В настоящее время локаторы бывают двух видов:<\/p>\n<ul>\n<li>CL_ABAP_DB_C_LOCATOR – для CLOB полей<\/li>\n<li>CL_ABAP_DB_X_LOCATOR – для BLOB полей<\/li>\n<\/ul>\n<p>Важные методы локаторов:<\/p>\n<ul>\n<li>GET_LENGTH – получает размер LOB поля подключенного к локатору<\/li>\n<li>FIND – поиск последовательности данных относительно смещения, возвращает позицию в LOB где встречается указанный для поиска шаблон. В Unicode системах размер символьного шаблона ограничен 1333 символами, в не Unicode системах 2666. Для байтового шаблона размер ограничен 2666 байтами.<\/li>\n<li>CLOSE – закрытие локатора и освобождение занятых им ресурсов<\/li>\n<li>IS_CLOSED – возвращает X если локатор закрыт<\/li>\n<li>GET_SUBSTRING – используется для CLOB полей, получает последовательность символов с указанным смещением и длинной<\/li>\n<li>GET_BYTES – тоже самое но для BLOB полей.<\/li>\n<\/ul>\n<p>Локаторы могут создаваться только через оператор SELECT и его атрибут INTO, как это было показано выше. Создание локаторов не может быть инициировано при изменении данных таблиц. После создания, локаторы могут быть использованы для копирования LOB полей между записями таблицы.<\/p>\n<p>Из-за нагрузки на СУБД закрытие локаторов должно происходить как можно скорее, причем в отличие от потоков, локаторы не закрываются автоматически при использовании циклического оператора SELECT, после команды ENDSELECT. Неявное закрытие локаторов происходит только после окончания LUW БД.<\/p>\n<p>Программа копирующее LOB поле через локатор:<\/p>\n<pre class=\"lang:abap decode:true\">REPORT demo_db_copy.\r\n\r\nPARAMETERS: source TYPE c LENGTH 255 LOWER CASE\r\n            DEFAULT '\/SAP\/PUBLIC\/BC\/ABAP\/Sources\/ABAP_Docu_Logo.gif',\r\n            target TYPE c LENGTH 255 LOWER CASE\r\n            DEFAULT 'picture_copy'.\r\n\r\nCLASS demo DEFINITION.\r\n  PUBLIC SECTION.\r\n    CLASS-METHODS main.\r\nENDCLASS.\r\n\r\nCLASS demo IMPLEMENTATION.\r\n  METHOD main.\r\n\r\n    DATA wa TYPE demo_blob_table LOCATOR FOR ALL COLUMNS.\r\n\r\n    SELECT SINGLE picture\r\n           FROM demo_blob_table\r\n           INTO wa-picture\r\n           WHERE name = source.\r\n\r\n    IF sy-subrc &lt;&gt; 0.\r\n      MESSAGE 'Nothing found, run DEMO_DB_WRITER first!'\r\n              TYPE 'S' DISPLAY LIKE 'E'.\r\n      RETURN.\r\n    ENDIF.\r\n\r\n    wa-name = target.\r\n    INSERT demo_blob_table FROM wa.\r\n\r\n    IF sy-subrc = 0.\r\n      MESSAGE 'You can run DEMO_DB_READER with new name now' TYPE 'S'.\r\n    ELSE.\r\n      MESSAGE 'Target already exists' TYPE 'S' DISPLAY LIKE 'E'.\r\n    ENDIF.\r\n\r\n    wa-picture-&gt;close( ).\r\n\r\n  ENDMETHOD.\r\nENDCLASS.\r\n\r\nSTART-OF-SELECTION.\r\n  demo=&gt;main( ).<\/pre>\n<p>Чтение данных, используя локатор:<\/p>\n<pre class=\"lang:abap decode:true\">REPORT demo_db_locator.\r\n\r\nPARAMETERS: pattern  TYPE c LENGTH 20 DEFAULT 'ABAP' LOWER CASE,\r\n            language TYPE sy-langu DEFAULT sy-langu.\r\n\r\nCLASS demo DEFINITION.\r\n  PUBLIC SECTION.\r\n    CLASS-METHODS main.\r\nENDCLASS.\r\n\r\nCLASS demo IMPLEMENTATION.\r\n  METHOD main.\r\n    DATA: otr_text_locator TYPE REF TO cl_abap_db_c_locator,\r\n          search_pattern   TYPE string,\r\n          length           TYPE i,\r\n          hits             TYPE i,\r\n          avg              TYPE p DECIMALS 2,\r\n          msg              TYPE string.\r\n\r\n    search_pattern = pattern.\r\n\r\n    TRY.\r\n        SELECT text\r\n               FROM sotr_textu\r\n               INTO otr_text_locator\r\n               WHERE langu = language.\r\n\r\n          length = length + otr_text_locator-&gt;get_length( ).\r\n\r\n          IF otr_text_locator-&gt;find( start_offset = 0\r\n                                     pattern = search_pattern ) &lt;&gt; -1.\r\n            hits = hits + 1.\r\n          ENDIF.\r\n\r\n          otr_text_locator-&gt;close( ).\r\n        ENDSELECT.\r\n      CATCH cx_lob_sql_error.\r\n        WRITE 'Exception in locator' COLOR = 6.\r\n        RETURN.\r\n    ENDTRY.\r\n\r\n    avg = length \/ sy-dbcnt.\r\n\r\n    msg = |Average length of strings in database table: { avg }|.\r\n    WRITE: \/ msg.\r\n    msg = |Occurrences of \"{ pattern WIDTH = strlen( pattern ) }\" | &amp;&amp;\r\n          |in strings of database table: { hits }|.\r\n    WRITE: \/ msg.\r\n  ENDMETHOD.\r\nENDCLASS.\r\n\r\nSTART-OF-SELECTION.\r\n  demo=&gt;main( ).<\/pre>\n<p>Справка на тему использования LOB и потоков: <a href=\"http:\/\/help.sap.com\/abapdocu_731\/en\/abenstreams_locators.htm\">Потоки и локаторы в OSQL<\/a>, <a href=\"http:\/\/help.sap.com\/abapdocu_731\/en\/abenstreaming.htm\">Потоки в обработке внутренних данных<\/a>. Видео <a href=\"http:\/\/scn.sap.com\/docs\/DOC-10235\">обзор<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Начиная с версии 7.0, EhP2 в ABAP была введена новая концепция обработки внутренних (внешних) данных &#8212; потоковая обработка данных. Поток – ссылка на последовательный набор записей данных, чей конец может быть не известен. Потоки разделяются по виду: потоки данных и фильтрующие потоки. Фильтрующие потоки в настоящее время не реализованы и не рассматриваются в данной статье. Потоки [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[307],"tags":[260,263,259,258,262,261],"_links":{"self":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/1518"}],"collection":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/comments?post=1518"}],"version-history":[{"count":8,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/1518\/revisions"}],"predecessor-version":[{"id":6494,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/1518\/revisions\/6494"}],"wp:attachment":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/media?parent=1518"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/categories?post=1518"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/tags?post=1518"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}