{"id":1660,"date":"2013-12-09T11:26:57","date_gmt":"2013-12-09T07:26:57","guid":{"rendered":"http:\/\/abap-blog.ru\/?p=1660"},"modified":"2021-10-02T21:39:09","modified_gmt":"2021-10-02T17:39:09","slug":"fajlovyj-interfejs-operacii-s-fajlami","status":"publish","type":"post","link":"https:\/\/abap-blog.ru\/osnovy-abap\/files\/fajlovyj-interfejs-operacii-s-fajlami\/","title":{"rendered":"Файловый интерфейс &#8212; операции с файлами"},"content":{"rendered":"<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/file-transfers-_114260033.s300x300.jpg\"><img loading=\"lazy\" class=\"size-full wp-image-1661 alignleft\" style=\"margin: 10px 30px 10px 10px;\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/file-transfers-_114260033.s300x300.jpg\" alt=\"file-transfers-_114260033.s300x300\" width=\"300\" height=\"232\" \/><\/a><strong>Файловый интерфейс и юникод<\/strong><\/p>\n<p>Поскольку содержимое файлов отражает структуру данных, обрабатываемую в памяти, файловый интерфейс в юникодных системах должен позволять следующее:<\/p>\n<ol>\n<li>Должна быть возможность обмена данными между юникодными и не юникодными системами (т.к. отображение данных в памяти отличается);<\/li>\n<li>Должна быть возможность обмена данными между различными юникодными системами;<\/li>\n<li>Должна быть возможность обмена данными между разными не юникодными системами, в которых используются различные кодировки.<\/li>\n<\/ol>\n<p><!--more--><\/p>\n<p>Данные требования накладывают определенные ограничения, так в юникодных системах требуется обязательное указание кодовой страницы, перед работой через интерфейс, кроме того:<\/p>\n<ul>\n<li>Файл должен быть явным образом открыт (OPEN DATASET), перед операцией чтения или записи. Кроме того файл, который был уже открыт ранее, не может быть открыт снова (до тех пор, пока не будет закрыт). В не юникодных системах открытие файла происходит неявным образом при обращении к нему (например, при чтении), соответственно не требуется явного открытия перед началом работы. Кроме того, выражение для открытия файла может быть запущено неоднократно, несмотря на то, что открыть файл в программе можно только после его закрытия, либо в первый раз. Повторное открытие в не юникодных системах просто пропускается.<\/li>\n<li>Тип доступа (INPUT,OUTPUT..) и режим обработки файла (TEXT, BINARY) должны быть явно определены, когда файл открывается. В не юникодных системах, если ничего не будет задано, файл откроется с неявно заданными параметрами по умолчанию.<\/li>\n<li>Если файл открыт для чтения, возможно только чтение. В не юникодных системах кроме чтения, возможна так же и запись.<\/li>\n<li>Если файл открыт как текстовый (дополнение TEXT), только символьные переменные могут быть считаны или записаны в него. В не юникодных системах допускается считывание и запись из байтовых или числовых переменных.<\/li>\n<\/ul>\n<p><b>Рекомендуется придерживаться правил определенных в юникодных системах, даже если вы работаете в не юникодной системе.<\/b><\/p>\n<p>Для поддержки работы с юникодом, был создан специальный системный класс CL_ABAP_FILE_UTILITIES. Некоторые его методы:<\/p>\n<ul>\n<li>CHECK_FOR_BOM – проверить наличие в файле метки <a href=\"http:\/\/ru.wikipedia.org\/wiki\/Byte_order_mark\">BOM<\/a>.<\/li>\n<li>CHECK_UTF8 – хранится ли файл в UTF-8. MAX_KB – определяет размер KB при сканировании.<\/li>\n<li>CREATE_UTF8_FILE_WITH_BOM – создание файла в UTF-8 с меткой.<\/li>\n<li>CHECK_XSTRING_UTF8 – проверить последовательность на наличие UTF-8 кодировки.<\/li>\n<li>CHECK_STRING_7BIT_ASCII – проверяет, содержит ли строка только ASCII символы.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2>Операторы файлового интерфейса<\/h2>\n<p>Как было уже упомянуто ранее, файловый интерфейс в ABAP реализован с помощью набора операторов и их параметров:<\/p>\n<ul>\n<li>OPEN DATASET<\/li>\n<li>TRANSFER<\/li>\n<li>READ DATASET<\/li>\n<li>GET DATASET<\/li>\n<li>SET DATASET<\/li>\n<li>TRUNCATE DATASET<\/li>\n<li>CLOSE DATASET<\/li>\n<li>DELETE DATASET<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3>OPEN DATASET<\/h3>\n<p>Синтаксис:<\/p>\n<p><strong>OPEN DATASET dset FOR access IN mode [position] [os_additions] [error_handling].<\/strong><\/p>\n<p>Данный оператор открывает файл, указанный в dset, для доступа указанного в access и режиме хранения mode. Dset – символьная переменная, в которой будет правильное, с точки зрения ОС, физическое имя файла. Файл нельзя открывать более одного раза, без закрытия, иначе система вызовет исключение (для юникодных систем).<\/p>\n<p>Дополнения position, os_additions, error_handling  указывают, с какой позиции начинать обработку файла, дополнения зависимые от ОС сервера приложений и поведение, связанное с обработкой ошибочных ситуаций.<\/p>\n<p>Особенности:<\/p>\n<ul>\n<li>Количество файлов одновременно обрабатываемых не может превышать 100, для одной сессии.<\/li>\n<li>При открытии набора срабатывают автоматические проверки полномочий (рассмотрены выше).<\/li>\n<li>Если имя файла приходит откуда-то извне, необходимо его проверить, чтобы не подвергать систему риску, связанному с обходом <a href=\"http:\/\/help.sap.com\/abapdocu_740\/en\/abendyn_file_scrty.htm\">доступа к директориям<\/a>:<\/li>\n<\/ul>\n<pre class=\"lang:abap decode:true\">CALL FUNCTION 'FILE_VALIDATE_NAME'\r\n\r\n  EXPORTING\r\n    logical_filename           = 'EXAMPLE_FILE'\r\n  CHANGING\r\n    physical_filename          = file\r\n  EXCEPTIONS\r\n    logical_filename_not_found = 1\r\n    validation_failed          = 2\r\n    OTHERS                     = 3.\r\nIF sy-subrc = 0.\r\n  OPEN DATASET file FOR OUTPUT IN BINARY MODE.\r\nELSE.\r\n  cl_demo_output=&gt;display( |Error return code { sy-subrc }| ).\r\nENDIF.<\/pre>\n<p>В приведенном ниже примере демонстрируется программа, в которой существует возможность обхода полномочий, так как нет проверки (уязвимость проявляет себя, когда в качестве части пути указываются «..\/» или «..\\»):<\/p>\n<pre class=\"lang:abap decode:true\">PARAMETERS: pv_fname TYPE c LENGTH 64 LOWER CASE DEFAULT 'test.txt',\r\n            pv_text  TYPE string LOWER CASE DEFAULT 'Содержимое файла'.\r\nDATA        lv_full_name TYPE string.\r\n\r\nAT SELECTION-SCREEN.\r\n  IF pv_fname = ''.\r\n    MESSAGE 'Необходимо указать имя файла' TYPE 'E'.\r\n  ENDIF.\r\n  lv_full_name = '\/tmp\/' &amp;&amp; pv_fname. \"Assume enduser inputs only a relative file name.\r\n\r\nSTART-OF-SELECTION.\r\n  OPEN DATASET lv_full_name FOR OUTPUT IN TEXT MODE ENCODING UTF-8 .\r\n  IF sy-subrc &lt;&gt; 0.\r\n    MESSAGE 'Не могу открыть файл' &amp;&amp; lv_full_name TYPE 'E'.\r\n  ELSE.\r\n    TRANSFER pv_text TO lv_full_name.\r\n    CLOSE DATASET lv_full_name.\r\n    WRITE :\/ 'Содержимое сохранено в:', lv_full_name.\r\n  ENDIF.<\/pre>\n<p>Возвращаемые значения поля ошибки, после вызова оператора:<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td valign=\"top\">sy-subrc<\/td>\n<td valign=\"top\">Значение<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\">0<\/td>\n<td valign=\"top\">Файл был открыт.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\">8<\/td>\n<td valign=\"top\">ОС не смогла открыть файл.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><b><i>Обрабатываемые исключения<\/i><\/b><\/p>\n<p><b>CX_SY_FILE_OPEN<\/b><\/p>\n<p>Причины: Файл уже открыт.<\/p>\n<p>Ошибка времени выполнения: DATASET_REOPEN<\/p>\n<p><b>CX_SY_CODEPAGE_CONVERTER_INIT<\/b><\/p>\n<p>Причина: Желаемое преобразование невозможно. (Либо неверно указана желаемая кодировка, либо указанная кодировка не поддерживается на уровне системы)<\/p>\n<p>Ошибка времени выполнения: CONVT_CODEPAGE_INIT<\/p>\n<p><b>CX_SY_CONVERSION_CODEPAGE<\/b><\/p>\n<p>Причина: Преобразование невозможно.<\/p>\n<p>Ошибка времени выполнения: CONVT_CODEPAGE<\/p>\n<p><b>CX_SY_FILE_AUTHORITY<\/b><\/p>\n<p>Причина: Нет доступа к файлу<\/p>\n<p>Ошибка времени выполнения: OPEN_DATASET_NO_AUTHORITY<\/p>\n<p>Причина: Нет доступа к открытию канала,  OPEN DATASET с дополнением FILTER.<\/p>\n<p>Ошибка времени выполнения: OPEN_PIPE_NO_AUTHORITY<\/p>\n<p><b>CX_SY_PIPES_NOT_SUPPORTED<\/b><\/p>\n<p>Причина: ОС не поддерживает именованные каналы.<\/p>\n<p>Ошибка времени выполнения: DATASET_NO_PIPE<\/p>\n<p><b>CX_SY_TOO_MANY_FILES<\/b><\/p>\n<p>Причина: Достигнуто максимальное число открытых файлов.<\/p>\n<p>Ошибка времени выполнения: DATASET_TOO_MANY_FILES<\/p>\n<p>&nbsp;<\/p>\n<p><b><i>Не обрабатываемые исключения<\/i><\/b><\/p>\n<p>Причина: Именованный канал уже открыт.<\/p>\n<p>Ошибка времени выполнения: DATASET_PIPE_POSITION<\/p>\n<p>&nbsp;<\/p>\n<h4>Дополнение access<\/h4>\n<p><strong>  &#8230; INPUT<\/strong><\/p>\n<p><strong>| OUTPUT<\/strong><br \/>\n<strong> | APPENDING<\/strong><br \/>\n<strong> | UPDATE &#8230; .<\/strong><\/p>\n<p>Дополнение указывает тип доступа, т.е. каким образом открывается файл: на чтение, запись, добавление или изменение. В юникодных системах указание данного дополнения является обязательным.<\/p>\n<ul>\n<li> <b>INPUT<\/b> – открывает файл для чтения. По умолчанию указатель внутри файла выставляется на начало файла (при работе с файлами важно понимать, что обычно они обрабатываются не целиком, а частями. Для того чтобы определить необходимое начало и конец, обрабатываемой части файла служит файловый указатель.). Если указанный файл не существует, поле sy-subrc будет равно 8. В юникодных программах запрещено вести запись в открытый для чтения файл, для не юникодных программ это ограничение не действует, однако для совместимости необходимо его соблюдать.<\/li>\n<li><b>OUTPUT<\/b> – открытие файла для записи. Если файл существовал ранее, его содержимое удаляется. Если файл не существует, он создается. Чтение так же разрешено.<\/li>\n<li><b>APPENDING<\/b> – открытие файла для добавления. Если файл уже существовал, он откроется,  указатель будет перемещен в конец файла. Если файл не существовал, он создается. Попытка чтения файла оператором READ DATASET будет прервана, sy-subrc возвратит 4.<\/li>\n<li><b>UPDATE<\/b> – открытие файла для обновления существующего содержимого. По умолчанию указатель будет выставлен в начало файла. Если указанный файл не существует, sy-subrc возвратит значение равное 8.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h4>Дополнение mode<\/h4>\n<p>Данное дополнение указывает на то, работаем ли мы с текстовым файлом или с бинарным. Атрибут LEGACY используется в том случае, когда мы хотим обеспечить совместимость с не юникодными системами.<\/p>\n<p>Синтаксис:<\/p>\n<p><strong>&#8230; {BINARY MODE}<\/strong><\/p>\n<p><strong> | {TEXT MODE encoding [linefeed] }<\/strong><br \/>\n<strong> | {LEGACY BINARY MODE [endian] [CODE PAGE cp]}<\/strong><br \/>\n<strong> | {LEGACY TEXT MODE [endian] [CODE PAGE cp] [linefeed]} &#8230; .<\/strong><\/p>\n<ul>\n<li> <b>BINARY MODE<\/b>  &#8212; открывает файл как бинарный файл. При записи или чтении, бинарное представление переменных переносится в файл (из файла) в неизменном состоянии.<\/li>\n<li><b>TEXT <\/b><b>MODE <\/b>– открывает файл как текстовый. Дополнение Encoding указывает на формат символьного представления (см. ниже). Когда происходит запись в файл, содержимое переменных преобразовывается в соответствии с форматом определенным в Encoding, после чего переносится в файл. Если переменная является символьной (clike) или плоской структурой, пробелы на концах обрезаются. Если используется строковый тип, пробелы не обрезаются. При записи данных, по умолчанию вставляется зависимый от платформы символ конца строки.<\/li>\n<\/ul>\n<p>Считывание происходит до символа конца строки, затем указанные символы преобразуются в соответствии с форматом определенным в Encoding, в текущий формат для сервера и записываются в переменную. Обработка символов конца строки зависит от дополнения linefeed.  Для юникодных программ, в данном режиме, при передаче или считывании из файла, могут быть использованы только символьные типы, кроме того необходимо обязательное указание дополнения encoding. В не юникодных программах дополнение encoding не обязательно. При перемещении указателя, при работе с текстовым файлом происходит перемещение на указанное количество символов, а не байт.<\/p>\n<ul>\n<li><b>LEGACY<\/b> – разница с простым открытием в том, что в данном случае можно задать кодовую страницу, через атрибут CODE PAGE и порядок байт, в атрибуте endian.  В режиме LEGACY TEXT MODE пробелы в символьных (clike) переменных или плоских структурах обрезаются.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h4><span style=\"font-size: 1em;\">Дополнение linefeed<\/span><\/h4>\n<p>Дополнение linefeed имеет следующий синтаксис:<\/p>\n<p><strong>&#8230; WITH { NATIVE <\/strong><\/p>\n<p><strong>| SMART<br \/>\n| UNIX<br \/>\n| WINDOWS } LINEFEED &#8230; .<\/strong><\/p>\n<p>При использовании данного дополнения, профильный параметр abap\/NTfmode (тр. RZ11) игнорируется. Нельзя использовать данное дополнение с дополнением TYPE, если его значение «NT» или «UNIX».<\/p>\n<p>Если данное дополнение не используется, правила определения символа конца строки зависят от текущего сервера приложений и платформы, на которой он запущен:<\/p>\n<ul>\n<li>Для UNIX систем (Unix, OS\/390, и IBM i5\/OS) это «LF».<\/li>\n<li>Для Windows – «CRLF». Кроме того для Windows систем может быть использован параметр abap\/NTfmode, который определяет какой символ конца строки использовать для новых файлов. Если его значение «b» &#8212; используется маркер «LF». Если его значение «t» или пустое – используется маркер «CRLF». Данный параметр может быть переопределен в дополнении TYPE и значением для его «NT» или «UNIX». Если существующий файл был открыт без дополнения TYPE, происходит поиск маркера, если маркер был найден, он и будет использоваться для всего файла. Если маркер не был найден, будет использоваться профильный параметр  abap\/NTfmode.<\/li>\n<\/ul>\n<p>Если дополнение было указано при открытии файла, оно может быть перезаписано, через оператор SET DATASET.<\/p>\n<p>SAP рекомендует указывать дополнение linefeed, т.к. если его не указать логика определения указателя конца строки будет зависеть от множества факторов: ОС сервера приложений, профильный параметр, существующий символ в имеющемся файле.<\/p>\n<p>Значения, указываемые в дополнении:<\/p>\n<ul>\n<li><b>NATIVE<\/b> – в зависимости от ОС на сервере приложений (см. выше)<\/li>\n<li><b>SMART<\/b> – данное дополнение зависит от типа доступа к файлу:\n<ul>\n<li>Если файл открыт на чтение (FOR INPUT), оба маркера будут обрабатываться. При открытии EBCDIC файла так же обрабатывается маркер «NL» (new line).<\/li>\n<li>Если файл открыт для дополнения или для обновления (APPENDING, UPDATE) происходит поиск маркера, который уже был использован в файле. Найденный маркер далее используется для записи. Если маркер не будет найден, будет использован маркер для ОС сервера приложений (как с дополнением NATIVE).<\/li>\n<li>Если файл открывается для записи (OUTPUT), маркер определяется в зависимости от ОС сервера приложений (как с дополнением NATIVE).<\/li>\n<li><b>UNIX<\/b> – используется «LF» маркер<\/li>\n<li><b>WINDOWS<\/b> – используется «CRLF» маркер<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h4>Дополнение CODEPAGE<\/h4>\n<p>Синтаксис:<\/p>\n<p><strong>&#8230;  CODE PAGE cp &#8230;<\/strong><\/p>\n<p>Указывает кодовую страницу, в которой представлены данные файла. Когда данные переносятся из файла в ABAP, происходит автоматическая конвертация в кодовую страницу, использующуюся на сервере приложений (если они не идентичны). При записи происходит аналогичная конвертация в указанную в дополнении кодировку.<\/p>\n<p>В юникодных системах происходит преобразование символов из указанной кодовой страницы в юникодные символы, в соответствии с текущим форматом на сервере приложений.<\/p>\n<p>В качестве параметра <b>cp<\/b> необходимо использовать переменную со значением из столбца CPCODEPAGE в таблице TCP00.<\/p>\n<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/codepages.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-1662\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/codepages.png\" alt=\"codepages\" width=\"796\" height=\"66\" srcset=\"https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/codepages.png 796w, https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/codepages-300x24.png 300w\" sizes=\"(max-width: 796px) 100vw, 796px\" \/><\/a><\/p>\n<h4><\/h4>\n<h4>Дополнение ENCODING<\/h4>\n<p>Синтаксис:<\/p>\n<p><b>&#8230; <\/b><b>ENCODING<\/b><b> { <\/b><b>DEFAULT<\/b><b> <\/b><b><br \/>\n<\/b><b>            <\/b><b> | {<\/b><b>UTF<\/b><b>-8 [<\/b><b>SKIPPING<\/b><b>|<\/b><b>WITH<\/b><b> <\/b><b>BYTE<\/b><b>&#8212;<\/b><b>ORDER<\/b><b> <\/b><b>MARK<\/b><b>]}<\/b><b> <\/b><b><br \/>\n<\/b><b>            <\/b><b> | <\/b><b>NON<\/b><b>&#8212;<\/b><b>UNICODE<\/b><b> } &#8230; .<\/b><\/p>\n<p>Определяет формат, используемый для текстовых файлов.  Данное дополнение обязательно для юникодных систем, в не юникодных может быть опущено (по умолчанию примет значение NON-UNICODE).<\/p>\n<p>SAP рекомендует всегда использовать UTF-8 при работе с текстовыми файлами. Так как кодовые страницы не всегда можно идентифицировать относительно содержимого файла.<\/p>\n<p>Может принимать следующие значения:<\/p>\n<ul>\n<li><b>DEFAULT<\/b> – в юникодных системах тоже самое что и UTF-8, для не юникодных систем NON-UNICODE.<\/li>\n<li><b>UTF-8<\/b> [SKIPPING|WITH BYTE-ORDER MARK] – файл обрабатывается в соответствии с кодировкой <a href=\"http:\/\/ru.wikipedia.org\/wiki\/UTF-8\">UTF-8<\/a>. С помощью дополнения указывается, необходимо ли обрабатывать символ порядка байт (<a href=\"http:\/\/ru.wikipedia.org\/wiki\/Byte_order_mark\">BOM<\/a>):\n<ul>\n<li>SKIPING BYTE-ORDER MARK – используется только если файл открывается для чтения или изменения, если в файле присутствует данный символ указатель переводится на позицию после него, без дополнения файл обрабатывается как обычно.<\/li>\n<li>WITH BYTE-ORDER MARK – используется для файлов открытых на запись (OUTPUT), если дополнение указано символ вставляется автоматически в начало файла, если не указано символ не будет вставлен.<\/li>\n<li><b>NON-<\/b><b>UNICODE<\/b> – для не юникодных систем, данные переносятся в файл (из файла) без дополнительной конвертации. В юникодной системе, происходит преобразование в соответствии с настроенным присвоением, таблица TCP0C.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/cpconvert.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-1663\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/cpconvert.png\" alt=\"cpconvert\" width=\"520\" height=\"37\" srcset=\"https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/cpconvert.png 520w, https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/cpconvert-300x21.png 300w\" sizes=\"(max-width: 520px) 100vw, 520px\" \/><\/a><\/p>\n<p>Дополнение BYTE-ORDER MARK не может использоваться одновременно с дополнением position (см. ниже).<\/p>\n<p>Рекомендации SAP:<\/p>\n<ul>\n<li>При открытии UTF-8 файлов на чтение желательно всегда пропускать символ порядка байт, использовать SKIPING дополнение.<\/li>\n<li>При записи в UTF-8 файл, желательно всегда записывать метку с дополнением WITH BYTE-ORDER MARK.<\/li>\n<li>С помощью класса CL_ABAP_FILE_UTILITIES и его метода  CREATE_UTF8_FILE_WITH_BOM, можно создать UTF-8 файл с меткой BOM. С помощью метода CHECK_UTF8 можно определить есть ли метка в указанном файле.<\/li>\n<\/ul>\n<p>UTF-16 файлы могут быть открыты только как бинарные файлы.<\/p>\n<h4><\/h4>\n<h4>Дополнение endian<\/h4>\n<p>Синтаксис:<\/p>\n<p><b>&#8230; {BIG|LITTLE} ENDIAN &#8230;<\/b><\/p>\n<p>Дополнение указывает <a href=\"http:\/\/ru.wikipedia.org\/wiki\/%D0%9F%D0%BE%D1%80%D1%8F%D0%B4%D0%BE%D0%BA_%D0%B1%D0%B0%D0%B9%D1%82%D0%BE%D0%B2\">порядок байтов<\/a> при записи числовых переменных ABAP (i, decfloat16, decfloat34, f, или s).<\/p>\n<p>&nbsp;<\/p>\n<h4>Дополнение position<\/h4>\n<p>Синтаксис:<\/p>\n<p><b>&#8230; <\/b><b>AT<\/b><b> <\/b><b>POSITION<\/b><b> <\/b><b>pos<\/b><b> &#8230; .<\/b><\/p>\n<p>Переводит указатель файла на указанное в переменной POS число байт. Если в качестве позиции передать -1, указатель будет переведен в конец файла.<\/p>\n<p>Следует знать следующие особенности:<\/p>\n<ul>\n<li>Если файл открыт на чтение и значение в pos больше размера файла, указатель становится неопределенным и чтение в таком  случае будет невозможно, до тех пор, пока указатель не будет переведен в пределы размера файла. Если файл обрабатывается в не юникодной системе и происходит запись в него, все последующие от конца файла байты до указателя будут заполнены 16-ричным представлением 0, а запись начнется со следующего байта.<\/li>\n<li>Если файл открыт для записи, все символы с начала файла, до указанной позиции заполняются 16-ричным представлением 0 и запись происходит со следующего байта.<\/li>\n<li>Если файл открывается для добавления (APPENDING), данное дополнение игнорируется, указатель выставляется в конец файла.<\/li>\n<li>Если файл открывается для изменения и позиция указана больше размера файла в байтах, все байты с конца файла по указанную позицию заполняются 16-ричным представлением 0 и запись происходит со следующего байта после указанной позиции.<\/li>\n<\/ul>\n<p>Дополнение не может быть использовано одновременно с дополнениями FILTER и BYTE-ORDER MARK.<\/p>\n<p>&nbsp;<\/p>\n<h4>Дополнения os_additions<\/h4>\n<p>Синтаксис:<\/p>\n<p><b>&#8230; [<\/b><b>TYPE<\/b><b> <\/b><b>attr<\/b><b>]<\/b><br \/>\n<b>    <\/b><b>[<\/b><b>FILTER<\/b><b> <\/b><b>opcom<\/b><b>] &#8230; .<\/b><\/p>\n<p>Данные дополнения указывают на специфические для ОС параметры при обработке файлов.<\/p>\n<ul>\n<li>Дополнение TYPE attr – зависит от ОС, используемой на сервере приложений. Если ОС не MS Windows, символьное значение, определенное в attr, содержит зависимые от ОС параметры для файла, который должен обрабатываться. Для MS Windows в этот параметр, при работе с текстовыми файлами или текстовыми файлами в режиме совместимости, может быть передан идентификатор символа конца строки: «NT» для CRLF «UNIX» для LF, но только в том случае, если не указано дополнение linefeed. Все остальные значения в данном параметре будут проигнорированы для MS Windows.<\/li>\n<\/ul>\n<p>Пример использования дополнения в ОС IBM i5\/OS:<\/p>\n<pre class=\"lang:abap decode:true\">OPEN DATASET 'test.dat' \r\n  TYPE 'lrecl=80, blksize=8000, recfm=FB' \r\n  FOR OUTPUT IN TEXT MODE \r\n             ENCODING DEFAULT \r\n             WITH SMART LINEFEED.<\/pre>\n<ul>\n<li>Дополнение FILTER opcom – данное дополнение поддерживается для ОС (Unix, Windows), работающих с так называемыми <a href=\"http:\/\/ru.wikipedia.org\/wiki\/%D0%98%D0%BC%D0%B5%D0%BD%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D1%8B%D0%B9_%D0%BA%D0%B0%D0%BD%D0%B0%D0%BB\">именованными каналами<\/a> (pipes). За более подробной информацией можете обратиться к <a href=\"http:\/\/help.sap.com\/abapdocu_740\/en\/abapopen_dataset_os_addition.htm#!ABAP_ADDITION_1@1@\">справке<\/a> по данному дополнению.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h4>Дополнения error_handling<\/h4>\n<p>Синтаксис:<\/p>\n<p><b>&#8230; [MESSAGE msg]<\/b><br \/>\n<b>    [IGNORING CONVERSION ERRORS]<\/b><br \/>\n<b>    [REPLACEMENT CHARACTER rc] &#8230; .<\/b><\/p>\n<p>В случае возникновения ошибок, данные дополнения позволяют получать эти ошибки, подавлять некоторые ошибки, определять символы замены для неизвестных символов.<\/p>\n<ul>\n<li>Дополнение MESSAGE msg. В случае возникновения ошибки на уровне сервера приложения, в символьную переменную msg будет записан код ошибки, пример:<\/li>\n<\/ul>\n<pre class=\"lang:abap decode:true\">DATA mess TYPE string. \r\n\r\nOPEN DATASET `` FOR INPUT IN BINARY MODE MESSAGE mess. \r\n\r\nIF sy-subrc = 8. \r\n  MESSAGE mess TYPE 'I'. \r\nENDIF.<\/pre>\n<ul>\n<li>Дополнение IGNORING CONVERSION ERRORS. Данное дополнение может быть использовано для подавления исключения CX_SY_CONVERSION_CODEPAGE. Данное исключение возникает, если при работе с файлом невозможно сделать преобразование из одной кодовой страницы в другую. Данное дополнение используется только при обработке текстовых файлов, текстовых файлов в режиме совместимости и бинарных файлов в режиме совместимости, но не для бинарных файлов. При этом каждый не конвертируемый символ заменяется по умолчанию символом «#», либо символом, указываемым в следующем дополнении.<\/li>\n<li>REPLACEMENT CHARACTER rc. В качестве rc указывается символ, на который будут заменены не распознанные символы.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h3>TRANSFER<\/h3>\n<p>Синтаксис:<\/p>\n<p><b>TRANSFER dobj TO dset [LENGTH len]<\/b><b> <\/b><b><br \/>\n[NO END OF LINE].<\/b><\/p>\n<p>Данный оператор переносит содержимое переменной dobj в файл dset. В качестве переменной может быть использована любая символьная переменная или плоская структура. При обработке бинарного файла используются байтовые типы (x, xstring).  В юникодных программах при записи в текстовый файл может использоваться только символьная переменная (не структура), данное ограничение не распространяется на текстовые файлы, открытые в режиме совместимости.<\/p>\n<p>В качестве dset указывается физическое имя файла. Содержимое dobj передается в файл начиная с текущей позиции указателя. После того, как данные будут перенесены в файл, курсор смесится на следующую позицию после перемещенных данных.<\/p>\n<p>Для записи в юникодных программах, необходимо чтобы файл был открыт для записи, добавления или изменения.  Если файл был не открыт заранее, в не юникодных системах он будет открыт неявно.<\/p>\n<p>В зависимости от типа доступа к файлу, есть определенные особенности:<\/p>\n<ul>\n<li>Файл открыт для чтения (FOR INPUT). Нельзя производить запись в юникодных программах. В не юникодных программах запись происходи так же, как если бы он был открыт с типом доступа &#8212; FOR UPDATE.<\/li>\n<li>Файл открыт для записи (FOR OUTPUT). Запись происходит, начиная с текущей позиции указателя, если указатель был перемещен дальше конца файла, байты с позиции конца файла, по текущую позицию будут записаны 16-ричным представлением 0.<\/li>\n<li>Если файл был открыт для добавления (APPENDING) , система начинает вести запись с текущего указателя, при первоначальном открытии указатель находится в конце файла.<\/li>\n<li>Файл открыт для изменения (CHANGING). Запись происходит с текущей позиции указателя, если указатель был перемещен дальше конца файла, байты с позиции конца файла, по текущую позицию будут записаны 16-ричным представлением 0. Если часть файла должна быть перезаписана, обязательно открывать с типом доступа CHANGING для юникодных программ. В не юникодных программах, файл, открытый для чтения может быть перезаписан, но SAP не рекомендует этого делать.<\/li>\n<\/ul>\n<p>Кроме того, на работу оператора влияет  тип содержимого файла:<\/p>\n<ul>\n<li>Если файл открыт как текстовый или текстовый в режиме совместимости, любые пробелы на концах символьных переменных обрезаются, кроме переменных с типом string. Если необходимо преобразование, в кодовую страницу отличную от системной, происходит преобразование, затем побайтно идет запись в файл.<\/li>\n<li>После записи в файл содержимого из dobj автоматически вставляется метка конца строки, определенная при открытии. Чтобы система не добавляла метку, используется дополнение NO END OF LINE.<\/li>\n<\/ul>\n<p>Следует знать некоторые особенности:<\/p>\n<ul>\n<li>Оператор TRANSFER либо возвращает sy-subrc  = 0, либо вызывает исключение.<\/li>\n<li>В не юникодных программах вызов OPEN DATASET перед TRANSFER не обязателен, поэтому в не юникодных программах при вызове оператора TRANSFER срабатывают автоматические проверки доступа к файлу, т.к. происходит неявный вызов OPEN DATASET.<\/li>\n<\/ul>\n<p>Дополнения:<\/p>\n<ul>\n<li>LENGTH len – определяет то, как много байтов или символов (в зависимости от типа содержимого) будет записано в файл.  Для бинарных, текстовых в режиме совместимости и бинарных в режиме совместимости файлов, дополнение определяет количество передаваемых байт.<\/li>\n<\/ul>\n<p>Если длинна 0 и меньше, ничего не будет записано.  Если количество в len больше количества символов или байт в dobj, вместо недостающих символов (байтов) в файл будут записаны пустые символы (пробелы) или 16-ричное представление 0.<\/p>\n<p>Пример использования оператора TRANSFER:<\/p>\n<pre class=\"lang:abap decode:true\">DATA: file TYPE string VALUE `flights.dat`, \r\n      wa   TYPE spfli. \r\n\r\nFIELD-SYMBOLS &lt;hex_container&gt; TYPE x. \r\n\r\nOPEN DATASET file FOR OUTPUT IN BINARY MODE. \r\n\r\nSELECT * \r\n       FROM spfli \r\n       INTO wa. \r\n  ASSIGN wa TO &lt;hex_container&gt; CASTING. \r\n  TRANSFER &lt;hex_container&gt; TO file. \r\nENDSELECT. \r\n\r\nCLOSE DATASET file.<\/pre>\n<p><b><i>Обрабатываемые<\/i><\/b><b><i> исключения<\/i><\/b><\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>CODEPAGE_<\/b><b>CONVERTER_<\/b><b>INIT<\/b><\/p>\n<p>Причина: Желаемое преобразование невозможно. (Либо неверно указана желаемая кодировка, либо указанная кодировка не поддерживается на уровне системы)<br \/>\nОшибка времени выполнения: CONVT_CODEPAGE_INIT<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>CONVERSION_<\/b><b>CODEPAGE<\/b><\/p>\n<p>Причина: Преобразование невозможно.<br \/>\nОшибка времени выполнения: CONVT_CODEPAGE<\/p>\n<p><b>CX_SY_FILE_AUTHORITY<\/b><\/p>\n<p>Причина: Нет доступа к файлу<br \/>\nОшибка времени выполнения: OPEN_DATASET_NO_AUTHORITY<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>FILE_<\/b><b>IO<\/b><\/p>\n<p>Причина: Ошибка при записи в файл.<br \/>\nОшибка времени выполнения: DATASET_WRITE_ERROR<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>FILE_<\/b><b>OPEN<\/b><\/p>\n<p>Причина: Файл не может быть открыт.<br \/>\nОшибка времени выполнения: DATASET_CANT_OPEN<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>FILE_<\/b><b>OPEN_<\/b><b>MODE<\/b><\/p>\n<p>Причина: Файл не был открыт для указанного типа доступа.<br \/>\nОшибка времени выполнения: DATASET_NOT_OPEN<\/p>\n<p>Причина: Файл открыт в юникодной программе с использованием OPEN DATASET &#8230; FOR INPUT и не может использоваться для записи.<br \/>\nОшибка времени выполнения: DATASET_READ_ONLY<\/p>\n<p><b>CX_SY_PIPE_REOPEN<\/b><\/p>\n<p>Причина: Рабочий процесс, в котором был открыт файл с именованным каналом либо закрыт, либо переключен.<br \/>\nОшибка времени выполнения: DATASET_PIPE_CLOSED<\/p>\n<p><b>CX_SY_TOO_MANY_FILES<\/b><\/p>\n<p>Причина: Достигнуто максимальное число открытых файлов.<br \/>\nОшибка времени выполнения: DATASET_TOO_MANY_FILES<\/p>\n<p>&nbsp;<\/p>\n<h2>READ DATASET<\/h2>\n<p>Синтаксис:<\/p>\n<p><b>READ DATASET dset INTO dobj [MAXIMUM LENGTH mlen]<\/b><br \/>\n<b>                           [[ACTUAL] LENGTH alen].<\/b><\/p>\n<p>Данный оператор производит чтение из файла dset в переменную dobj. В качестве переменной может выступать либо переменная с элементарным типом, либо переменная с типом плоской структуры. В юникодных программах обязательно чтобы переменная была символьной, если файл открыт как текстовый. Чтение происходит с текущей позиции указателя в файле. После того как чтение осуществлено, указатель перемещается на длину считанных данных.<\/p>\n<p>В юникодных программах для того чтобы производить чтение из файла, он должен быть открыт с любым типом доступа.  Если файл не был открыт в не юникодной программе, его открытие происходит неявным образом.<\/p>\n<p>На работу оператора влияет тип содержимого в файле:<\/p>\n<ul>\n<li>Если файл открыт как текстовый или как текстовый в режиме совместимости, данные считываются с текущей позиции до метки конца строки, указатель перемещается на позицию после метки конца строки. Если последний символ, в текстовым файле, не является меткой конца строки, конец текстового файла интерпретируется как конец строки.<\/li>\n<\/ul>\n<p>Если переменная dobj слишком коротка относительно считываемых символов, лишние символы обрезаются. Если же она длиннее, переменная заполняется пробелами справа. Если же dobj строковая переменная (тип string) в неё передаются только считанные символы.<\/p>\n<ul>\n<li>Если файл открыт как бинарный или как бинарный в режиме совместимости, система считывает ровно столько байтов, сколько может уместиться в переменной dobj. Файловый указатель так же перемещается по мере считывания. Если переменная dobj больше размеров файла, она заполняется 16-ричным представлением 0 справа. Если dobj строка, система пытается считать весь файл в переменную.<\/li>\n<\/ul>\n<p>Если при открытии файла указана необходимость в конвертации кодировок, она срабатывает до присвоения данных переменной, после чего в неё побайтно передаются сконвертированные данные.<\/p>\n<p><b>Заполнение поля <\/b><b>sy-<\/b><b>subrc<\/b><\/p>\n<p>Для текстовых файлов<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td valign=\"top\"><b>sy-subrc<\/b><\/td>\n<td valign=\"top\"><b>Значение<\/b><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\">0<\/td>\n<td valign=\"top\">Данные считаны до явно определенной метки конца строки или до неявной метки конца строки в конце файла.<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\">4<\/td>\n<td valign=\"top\">Была сделана попытка чтения данных после конца файла.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Для бинарных файлов<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td valign=\"top\"><b>sy-subrc<\/b><\/td>\n<td valign=\"top\"><b>Значение<\/b><\/td>\n<\/tr>\n<tr>\n<td valign=\"top\">0<\/td>\n<td valign=\"top\">Данные были считаны; при этом система либо достигла конца файла, либо нет<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\">4<\/td>\n<td valign=\"top\">Либо была совершена попытка чтения после конца файла, либо переменная в которую происходит чтение оказалась длиннее его содержимого<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Существуют следующие особенности:<\/p>\n<ul>\n<li>Так как в не юникодных программах открытие файла может происходить не явно, для них вызывается автоматическая проверка полномочий.<\/li>\n<li>Текстовый файл без явно записанных меток конца строки, всегда имеет неявную метку конца строки в конце файла.<\/li>\n<li>При переносе цифровых данных или смешанных структур рекомендуется считывать данные в ссылочную переменную байтового типа, присвоенную с помощью дополнения CASTING (ниже будет показан альтернативный способ считывания, непосредственно в байтовый буфер):<\/li>\n<\/ul>\n<pre class=\"lang:abap decode:true\">DATA: file TYPE string VALUE `flights.dat`,\r\n      wa   TYPE spfli,\r\n      itab LIKE TABLE OF wa.\r\n\r\nFIELD-SYMBOLS &lt;hex_container&gt; TYPE x.\r\n\r\nOPEN DATASET file FOR INPUT IN BINARY MODE.\r\n\r\nASSIGN wa TO &lt;hex_container&gt; CASTING.\r\n\r\nDO.\r\n  READ DATASET file INTO &lt;hex_container&gt;.\r\n  IF sy-subrc = 0.\r\n    APPEND wa TO itab.\r\n  ELSE.\r\n    EXIT.\r\n  ENDIF.\r\nENDDO.\r\n\r\nCLOSE DATASET file.<\/pre>\n<p>Дополнения:<\/p>\n<ul>\n<li><b>[ACTUAL] LENGTH alen<\/b>  &#8212; записывает считанный объем данных в переменную alen. Для текстовых – количество символов, для бинарных и в режиме совместимости – количество байт. <b> <\/b>Слово ACTUAL было введено, чтобы отличать это дополнение от следующего и должно быть всегда использовано.<\/li>\n<li><b>MAXIMUM<\/b><b> <\/b><b>LENGTH<\/b><b> <\/b><b>mlen<\/b><b> <\/b><b>– <\/b>определяет, как много символов (байт) будет считано из файла. Для текстовых – количество символов, для бинарных и в режиме совместимости – количество байт. Пример:<\/li>\n<\/ul>\n<pre class=\"lang:abap decode:true\">DATA: file TYPE string VALUE `flights.dat`,\r\n      hex_container TYPE x LENGTH 1000,\r\n      len TYPE i,\r\n      itab          TYPE TABLE OF spfli.\r\n\r\nFIELD-SYMBOLS &lt;spfli&gt; TYPE spfli.\r\n\r\nDESCRIBE FIELD &lt;spfli&gt; LENGTH len IN BYTE MODE.\r\n\r\nOPEN DATASET file FOR INPUT IN BINARY MODE.\r\n\r\nASSIGN hex_container TO &lt;spfli&gt; CASTING.\r\n\r\nDO.\r\n  READ DATASET file INTO hex_container MAXIMUM LENGTH len.\r\n  IF sy-subrc = 0.\r\n    APPEND &lt;spfli&gt; TO itab.\r\n  ELSE.\r\n    EXIT.\r\n  ENDIF.\r\nENDDO.\r\n\r\nCLOSE DATASET file.<\/pre>\n<p><b><i>Обрабатываемые<\/i><\/b><b><i> исключения<\/i><\/b><b><i><\/i><\/b><\/p>\n<p><b>CX_SY_CODEPAGE_CONVERTER_INIT<\/b><\/p>\n<p>Причина: Желаемое преобразование невозможно. (Либо неверно указана желаемая кодировка, либо указанная кодировка не поддерживается на уровне системы)<br \/>\nОшибка времени выполнения: CONVT_CODEPAGE_INIT<\/p>\n<p><b>CX_SY_CONVERSION_CODEPAGE<\/b><\/p>\n<p>Причина: Преобразование невозможно.<br \/>\nОшибка времени выполнения: CONVT_CODEPAGE<\/p>\n<p><b>CX_SY_FILE_AUTHORITY<\/b><\/p>\n<p>Причина: Нет доступа к файлу<br \/>\nОшибка времени выполнения: OPEN_DATASET_NO_AUTHORITY<\/p>\n<p><b>CX_SY_FILE_IO<\/b><\/p>\n<p>Причина: Ошибка при чтении файла.<br \/>\nОшибка времени выполнения: DATASET_READ_ERROR<\/p>\n<p><b>CX_SY_FILE_OPEN<\/b><\/p>\n<p>Причина: Файл не был открыт.<br \/>\nОшибка времени выполнения: DATASET_CANT_OPEN<\/p>\n<p><b>CX_SY_FILE_OPEN_MODE<\/b><\/p>\n<p>Причина: Файл не был открыт для указанного режима.<br \/>\nОшибка времени выполнения: DATASET_NOT_OPEN<\/p>\n<p><b>CX_SY_PIPE_REOPEN<\/b><\/p>\n<p>Причина: Рабочий процесс, в котором был открыт файл с именованным каналом либо закрыт, либо переключен.<br \/>\nОшибка времени выполнения: DATASET_PIPE_CLOSED<\/p>\n<p>&nbsp;<\/p>\n<h2>GET DATASET<\/h2>\n<p>Синтаксис:<\/p>\n<p><b>GET DATASET dset [POSITION pos] [ATTRIBUTES attr].<\/b><\/p>\n<p>Данный оператор необходим для получения информации о наборе данных dset. При работе с ним, системное поле с кодом ошибки (sy-subrc) всегда равно 0, однако могут быть вызваны исключения (см. ниже)<\/p>\n<p>Если вызывать оператор без дополнений, он может использоваться для проверки, был ли открыт набор данных ранее, если нет, система вызовет исключение.<\/p>\n<p>Дополнения:<\/p>\n<ul>\n<li><b>POSITION pos<\/b>  &#8212; считывает в переменную pos, с типом i, текущий адрес указателя в файле. Позиция указателя всегда определена в байтах. Если позиция находится в начале файла, значение в переменной будет равно 0. Данное дополнение, не может быть одновременно использовано с описанным выше дополнением FILTER (система вызовет исключение). Для файлов, чей размер превышает 2 ГБ, невозможно получить все позиции указателя в файле. (не хватит диапазона типа i). Пример:<\/li>\n<\/ul>\n<pre class=\"lang:abap decode:true\">DATA: file TYPE string VALUE 'test.dat',\r\n      text TYPE string, pos TYPE i.\r\n\r\nOPEN DATASET file FOR OUTPUT IN TEXT MODE\r\n                             ENCODING DEFAULT\r\n                             WITH SMART LINEFEED.\r\nTRANSFER '1234567890' TO file.\r\nGET DATASET file POSITION pos.\r\nTRANSFER 'ABCDEFGHIJ' TO file.\r\nCLOSE DATASET file.\r\n\r\nOPEN DATASET file FOR INPUT IN TEXT MODE\r\n                            ENCODING DEFAULT\r\n                            WITH SMART LINEFEED\r\n                            AT POSITION pos.\r\nREAD DATASET file INTO text.\r\nCLOSE DATASET file.<\/pre>\n<ul>\n<li> <b>ATTRIBUTES attr<\/b>  &#8212; считывает атрибуты открытого набора данных. В качестве attr используется переменная с типом dset_attributes:<\/li>\n<\/ul>\n<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-1665\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr.png\" alt=\"attr\" width=\"478\" height=\"317\" srcset=\"https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr.png 478w, https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr-300x198.png 300w\" sizes=\"(max-width: 478px) 100vw, 478px\" \/><\/a><\/p>\n<p>Данная структура имеет два компонента, фиксированные атрибуты и изменяемые атрибуты. Изменяемые атрибуты можно поменять с помощью оператора SET DATASET (см. ниже). В следующем примере проверяется, открыт ли файл с дополнением FILTER, если нет, можно считать указатель файла:<\/p>\n<pre class=\"lang:abap decode:true\">DATA: dset TYPE string VALUE 'test.dat', \r\n      pos TYPE I, attr TYPE dset_attributes.\r\n\r\nOPEN DATASET dset FOR INPUT IN BINARY MODE \r\n                  FILTER 'uncompress'. \r\n\r\n... \r\n\r\nGET DATASET dset ATTRIBUTES attr. \r\nIF attr-fixed-indicator-filter &lt;&gt; 'X'. \r\n  GET DATASET dset POSITION pos. \r\nELSE. \r\n  ... \r\nENDIF. \r\n\r\nCLOSE DATASET dset.<\/pre>\n<p><b><i>Обрабатываемые исключения<\/i><\/b><\/p>\n<ul>\n<li><b>CX_SY_FILE_OPEN_MODE<\/b> &#8212; файл не открыт.<\/li>\n<li><b>CX_SY_FILE_POSITION<\/b> – невозможно получить позицию указателя файла.<\/li>\n<li><b>CX_SY_CONVERSION_OVERFLOW<\/b> – переменная pos слишком мала, чтобы в неё можно было записать позицию указателя.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<h2>SET DATASET<\/h2>\n<p>Синтаксис:<\/p>\n<p><b>SET DATASET dset [POSITION {pos|{END OF FILE}}]<\/b><br \/>\n<b>[ATTRIBUTES attr].<\/b><\/p>\n<p>Данный оператор позволяет изменять позицию курсора в файле, а так же изменяемые атрибуты набора данных.<\/p>\n<p>Дополнения:<\/p>\n<ul>\n<li>[POSITION {pos|{END OF FILE}}] – перемещает указатель файла на позицию указанную в переменной pos, с типом i, либо если указано END OF FILE на конец файла. Если в переменной pos будет 0, указатель переместиться в начало файла, если – 1 в конец. Другие отрицательные значения не разрешается использовать. В зависимости от типа доступа, в котором открыт файл, есть некоторые особенности:\n<ul>\n<li>Если файл открыт для чтения, и позиция pos будет больше чем длинна файла, указатель будет перемещен вне файла, считать данные не получится до тех пор, пока указатель не будет перемещен в тело файла. Если в не юникодной программе совершить при этом запись, файл с конца будет заполнен 16-ричным представлением 0 до текущей позиции, после чего произойдет запись.<\/li>\n<li>Если файл был открыт для записи или изменения и курсор был перемещен за пределы файла, при записи в него, с конца файла до текущей позиции он будет заполнен 16-ричным представлением 0, затем произойдет запись.<\/li>\n<li>Если файл был открыт для добавления, позиция указателя в нем всегда остается в его конце.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>Данное дополнение не может быть использовано, если файл был открыт с дополнением FILTER. Для файлов более 2 ГБ, невозможно определить позицию указателя.  Произвольное перемещение указателя больше подходит для бинарных файлов, чем для текстовых. В текстовых файлах позиция будет зависеть от кодировки, символов конца строки, использования юникода, а так же метки порядка байт.  Пример использования дополнения:<\/p>\n<pre class=\"lang:abap decode:true\">DATA: file TYPE string VALUE 'test1.dat',\r\npos TYPE i,\r\ntext TYPE string.\r\n\r\nOPEN DATASET file FOR OUTPUT IN TEXT MODE\r\nENCODING DEFAULT\r\nWITH SMART LINEFEED.\r\n\r\nTRANSFER: 'Line1' TO file,\r\n'Line2' TO file,\r\n'Line3' TO file.\r\n\r\nSET DATASET file POSITION 0.\r\nREAD DATASET file INTO text.\r\nSET DATASET file POSITION END OF FILE.\r\n\r\nTRANSFER: 'Line4' TO file,\r\n'Line5' TO file,\r\n'Line6' TO file.\r\n\r\nCLOSE DATASET file.<\/pre>\n<ul>\n<li>ATTRIBUTES attr – устанавливает изменяемые атрибуты. Для некоторых из изменяемых атрибутов существуют константы из пула типов DSET:<\/li>\n<\/ul>\n<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr2.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-1664\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr2.png\" alt=\"attr2\" width=\"355\" height=\"513\" srcset=\"https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr2.png 355w, https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/attr2-207x300.png 207w\" sizes=\"(max-width: 355px) 100vw, 355px\" \/><\/a><\/p>\n<p>Пример:<\/p>\n<pre class=\"lang:abap decode:true\">DATA: dset TYPE string VALUE 'test.dat', \r\nattr TYPE dset_attributes. \r\n\r\nOPEN DATASET dset FOR INPUT IN LEGACY TEXT MODE \r\nWITH NATIVE LINEFEED. \r\n\r\n... \r\n\r\nGET DATASET dset ATTRIBUTES attr. \r\n\r\nIF attr-fixed-mode = 'T' OR \r\nattr-fixed-mode = 'LT'. \r\nCLEAR attr-changeable. \r\nattr-changeable-indicator-conv_errors = 'X'. \r\nattr-changeable-conv_errors = 'I'. \r\nattr-changeable-indicator-linefeed_mode = 'X'. \r\nattr-changeable-linefeed_mode = 'S'. \r\nIF attr-fixed-mode = 'LT'. \r\nattr-changeable-indicator-code_page = 'X'. \r\nattr-changeable-code_page = '1100'. \r\nENDIF. \r\nSET DATASET dset ATTRIBUTES attr-changeable. \r\nENDIF. \r\n\r\nCLOSE DATASET dset.<\/pre>\n<p><b><i>Обрабатываемые<\/i><\/b><b><i> исключения<\/i><\/b><\/p>\n<p><b>CX_SY_CODEPAGE_CONVERTER_INIT<\/b><\/p>\n<p>Причина: Желаемое преобразование невозможно. (Либо неверно указана желаемая кодировка, либо указанная кодировка не поддерживается на уровне системы)<br \/>\nОшибка времени выполнения: CONVT_CODEPAGE_INIT<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>CONVERSION_<\/b><b>CODEPAGE<\/b><\/p>\n<p>Причина: Изменение символов замены и обработки ошибок возможно лишь для файлов открытых в TEXT MODE или LEGACY &#8230; MODE.<br \/>\nОшибка времени выполнения: CONVT_CODEPAGE<\/p>\n<p><b>CX_SY_FILE_OPEN_MODE<\/b><\/p>\n<p>Причина: Файл открыт на чтение, изменение невозможно<br \/>\nОшибка времени выполнения: DATASET_READ_ONLY<\/p>\n<p>Причина: Файл не был открыт.<br \/>\nОшибка времени выполнения: DATASET_NOT_OPEN<\/p>\n<p>Причина: Файл открыт в неподдерживаемом режиме.<br \/>\nОшибка времени выполнения: DATASET_INCOMPATIBLE_MODE<\/p>\n<p><b>CX_SY_FILE_POSITION<\/b><\/p>\n<p>Причина: Ошибка при смене указателя.<br \/>\nОшибка времени выполнения: DATASET_SEEK_ERROR<\/p>\n<p>Причина: Нет доступа для смены позиции.<br \/>\nОшибка времени выполнения: DATASET_NO_POSITION<\/p>\n<p>Причина: Перемещение невозможно на указанную позицию, слишком большая позиция.<br \/>\nОшибка времени выполнения: DATASET_OFFSET_TOO_LARGE<\/p>\n<p><b><i>Не обрабатываемые исключения<\/i><\/b><\/p>\n<p>Причина: Невозможно изменить позицию для именованного канала.<br \/>\nОшибка времени выполнения: DATASET_PIPE_POSITION<\/p>\n<p>&nbsp;<\/p>\n<h2>TRUNCATE DATASET<\/h2>\n<p>Синтаксис:<\/p>\n<p><b>TRUNCATE DATASET dset AT {CURRENT POSITION}|{POSITION pos}.<\/b><\/p>\n<p>С помощью данного оператора можно изменить размер файла (уменьшить или увеличить). Уменьшается когда позиция указателя после AT меньше текущего размера файла, увеличивается, когда больше. При увеличении размера файл заполняется 16-ричным представлением 0.<\/p>\n<p>Оператор можно использовать, если файл открыт на запись, изменение или дополнение, а так же не указано дополнение FILTER.<\/p>\n<p>Оператор всегда возвращает sy-subrc равное 0, либо вызывает исключение. Оператор не устанавливает новую позицию для указателя в файле. Если файл открыт для добавления, указатель перемещается непосредственно перед записью в файл.<\/p>\n<p>Дополнения:<\/p>\n<ul>\n<li>CURRENT POSITION  &#8212; устанавливает конец в файла в текущей позиции<\/li>\n<li>POSITION pos – устанавливает конец файла в указанной в pos позиции. В pos может быть передана любая числовая переменная, если её значение целое и не отрицательное.<\/li>\n<\/ul>\n<p>Пример использования оператора TRUNCATE:<\/p>\n<pre class=\"lang:abap decode:true\">DATA: name TYPE string VALUE `test.dat`,\r\n      hex  TYPE xstring.\r\n\r\nhex = 'FFFF'.\r\n\r\nOPEN DATASET name FOR OUTPUT IN BINARY MODE.\r\n\r\nTRANSFER hex TO name.\r\nSET DATASET name POSITION 0.\r\nREAD DATASET name INTO hex.\r\n\r\nTRUNCATE DATASET name AT POSITION 1.\r\nSET DATASET name POSITION 0.\r\nREAD DATASET name INTO hex.\r\n\r\nTRUNCATE DATASET name AT POSITION 2.\r\nSET DATASET name POSITION 0.\r\nREAD DATASET name INTO hex.\r\n\r\nCLOSE DATASET name.<\/pre>\n<p>После первого вызова оператора в файле останется значение «FF», после второго «FF00».<\/p>\n<p><b><i>Обрабатываемые исключения<\/i><\/b><\/p>\n<p><b>CX_SY_FILE_OPEN<\/b><\/p>\n<p>Причина: Файл не был открыт.<br \/>\nОшибка времени выполнения: DATASET_NOT_OPEN<\/p>\n<p>Причина: Файл открыт только для чтения.<br \/>\nОшибка времени выполнения: DATASET_READ_ONLY<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>FILE_<\/b><b>AUTHORITY<\/b><\/p>\n<p>Причина: Нет доступа к файлу<br \/>\nОшибка времени выполнения: OPEN_DATASET_NO_AUTHORITY<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>FILE_<\/b><b>POSITION<\/b><\/p>\n<p>Причина: Указана неверная позиция.<br \/>\nОшибка времени выполнения: DATASET_OFFSET_TOO_LARGE<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>FILE_<\/b><b>TRUNCATE<\/b><\/p>\n<p>Причина: ОС не может изменить размер файла.<br \/>\nОшибка времени выполнения: DATASET_TRUNCATE_ERROR<\/p>\n<p>Причина: Невозможно изменить размер файла, открытого с дополнением FILTER.<br \/>\nОшибка времени выполнения: DATASET_TRUNCATE_ERROR<\/p>\n<p><b><i>Не обрабатываемые исключения<\/i><\/b><\/p>\n<p>Причина: Внутренняя ошибка.<br \/>\nОшибка времени выполнения: DATASET_TRUNCATE_ERROR<\/p>\n<p>&nbsp;<\/p>\n<h2>CLOSE DATASET<\/h2>\n<p>Синтаксис:<\/p>\n<p><b>CLOSE DATASET dset.<\/b><\/p>\n<p>Оператор закрывает набор данных. Если файл уже был закрыт или еще не открыт, система игнорирует данный оператор, sy-subrc равен 0.  Если в ОС используется буфер при изменении файла, все что было в нем, переносится в файл.  Если при закрытии программы не было явного вызова закрытия набора данных, он закрывается автоматически.<\/p>\n<p>Если файл открыт с дополнением FILTER, при его закрытии sy-subrc содержит код возврата из именованного канала, возвращаемый ОС. Если не было исключений sy-subrc равно 0.<\/p>\n<p><b><i>Обрабатываемые исключения<\/i><\/b><\/p>\n<p><b>CX_SY_FILE_CLOSE<\/b><\/p>\n<p>Причина: Файл не был закрыт. Возможной причиной является недостаток памяти.<br \/>\nОшибка времени выполнения: DATASET_CANT_CLOSE<\/p>\n<p>&nbsp;<\/p>\n<h2>DELETE DATASET<\/h2>\n<p>Синтаксис:<\/p>\n<p><b>DELETE DATASET dset.<\/b><\/p>\n<p>Удаляет указанный файл, при этом он может быть закрыт или открыт.  Если имя файла приходит извне, оно может нести серьезный риск из-за обхода директорий (см. выше) и требует дополнительной проверки.<\/p>\n<p>Если значение поля sy-subrc равно 0, файл был удален. Если значение поля sy-subrc равно 4, файл не был удален.<\/p>\n<p><b><i>Обрабатываемые исключения<\/i><\/b><\/p>\n<p><b>CX_SY_FILE_AUTHORITY<\/b><\/p>\n<p>Причина: Нет доступа к файлу<br \/>\nОшибка времени выполнения: OPEN_DATASET_NO_AUTHORITY<\/p>\n<p><b>CX_<\/b><b>SY_<\/b><b>FILE_<\/b><b>OPEN<\/b><\/p>\n<p>Причина: Файл не может быть открыт<br \/>\nОшибка времени выполнения: DATASET_CANT_OPEN<\/p>\n<p>&nbsp;<\/p>\n<h2>Дополнительные операции при работе с файлами<\/h2>\n<p>Файловый интерфейс ABAP не предоставляет таких возможностей, как: переименовать файл (без его копирования в другой файл), листинга в директориях на сервере приложений,  копирования файла без его полного считывания через сервер приложений и др. Большинство этих операций выполняются на уровне системных команд сервера приложений, таких как: cp, mv, mkdir и других.<\/p>\n<p>Для демонстрации работы данных операций можно посмотреть программу <a href=\"http:\/\/scn.sap.com\/community\/abap\/blog\/2012\/05\/03\/al11-replacement\">ZAL11<\/a>, которая является заменой стандартной тр. AL11, но с более продвинутыми возможностями:<\/p>\n<p><a href=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/zall11.png\"><img loading=\"lazy\" class=\"alignnone size-large wp-image-1666\" src=\"http:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/zall11-1024x459.png\" alt=\"zall11\" width=\"550\" height=\"246\" srcset=\"https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/zall11-1024x459.png 1024w, https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/zall11-300x134.png 300w, https:\/\/abap-blog.ru\/wp-content\/uploads\/2013\/12\/zall11.png 1213w\" sizes=\"(max-width: 550px) 100vw, 550px\" \/><\/a><\/p>\n<p>Так, например, выглядит процедура копирования (перемещения) файла (директории):<\/p>\n<pre class=\"lang:abap decode:true\">*&amp;---------------------------------------------------------------------*\r\n*&amp;      Form  COPY_ITEM\r\n*&amp;---------------------------------------------------------------------*\r\n*       Copy or move remote file\/folder\r\n*----------------------------------------------------------------------*\r\n*      --&gt;PW_NAME        File\/folder to move\/copy\r\n*      --&gt;PW_PATH_TARGET Target folder\r\n*      --&gt;PW_ACTION      Move : 2, copy : 1\r\n*      --&gt;PW_TYPE        0=file, 1=folder\r\n*----------------------------------------------------------------------*\r\nFORM copy_item USING pw_name TYPE c\r\n                     pw_path_target TYPE c\r\n                     pw_action TYPE i\r\n                     pw_type TYPE i.\r\n  DATA : lw_command(1000) TYPE c,\r\n         lw_action(1) TYPE c,\r\n         lw_name TYPE string,\r\n         lw_target TYPE string.\r\n\r\n* Authority check for move\/copy files\r\n  IF s_auth-move_file NE c_true AND pw_type = 0.\r\n    MESSAGE 'You are not allowed to perform this action'(e21)\r\n            TYPE 'S' DISPLAY LIKE 'E'.\r\n    EXIT.\r\n  ENDIF.\r\n\r\n* Authority check for move\/copy folders\r\n  IF s_auth-move_folder NE c_true AND pw_type = 1.\r\n    MESSAGE 'You are not allowed to perform this action'(e21)\r\n            TYPE 'S' DISPLAY LIKE 'E'.\r\n    EXIT.\r\n  ENDIF.\r\n\r\n  CONCATENATE '\"' pw_name '\"' INTO lw_name.\r\n  CONCATENATE '\"' pw_path_target '\"' INTO lw_target.\r\n\r\n* Confirm action on remote server\r\n  IF pw_action = 1.\r\n    lw_command = 'Are you sure you want to copy # into # ?'(t01).\r\n  ELSE.\r\n    lw_command = 'Are you sure you want to move # into # ?'(t02).\r\n  ENDIF.\r\n  REPLACE FIRST OCCURRENCE OF c_wildcard IN lw_command WITH lw_name.\r\n  REPLACE FIRST OCCURRENCE OF c_wildcard IN lw_command WITH lw_target.\r\n  PERFORM confirm_action USING lw_command CHANGING lw_action.\r\n  IF lw_action = space.\r\n    EXIT.\r\n  ENDIF.\r\n\r\n  IF pw_action = 1.\r\n* Server command to copy file\/folder\r\n    CONCATENATE 'cp -r' lw_name lw_target INTO lw_command\r\n                SEPARATED BY space.\r\n  ELSE.\r\n* Server command to move file\/folder\r\n    CONCATENATE 'mv' lw_name lw_target INTO lw_command\r\n                SEPARATED BY space.\r\n  ENDIF.\r\n  CALL 'SYSTEM' ID 'COMMAND' FIELD lw_command.\r\n\r\n* If application server is too fast, file server is not updated\r\n* before querriing. Wait 1 second after server action\r\n  WAIT UP TO 1 SECONDS.\r\n\r\nENDFORM.<\/pre>\n<p>Вызов системных команд подобным образом, не является безопасным, подробнее читайте в <a title=\"Безопасный запуск системных команд из ABAP\" href=\"http:\/\/scn.sap.com\/community\/abap\/blog\/2013\/10\/29\/secure-execution-of-os-commands-by-abap-programs\" target=\"_blank\" rel=\"noopener\">блоге<\/a>.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Файловый интерфейс и юникод Поскольку содержимое файлов отражает структуру данных, обрабатываемую в памяти, файловый интерфейс в юникодных системах должен позволять следующее: Должна быть возможность обмена данными между юникодными и не юникодными системами (т.к. отображение данных в памяти отличается); Должна быть возможность обмена данными между различными юникодными системами; Должна быть возможность обмена данными между разными не юникодными системами, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[311],"tags":[271,272,268],"_links":{"self":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/1660"}],"collection":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/comments?post=1660"}],"version-history":[{"count":13,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/1660\/revisions"}],"predecessor-version":[{"id":7894,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/1660\/revisions\/7894"}],"wp:attachment":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/media?parent=1660"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/categories?post=1660"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/tags?post=1660"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}