{"id":621,"date":"2012-03-19T15:41:39","date_gmt":"2012-03-19T11:41:39","guid":{"rendered":"http:\/\/abap-blog.ru\/?p=621"},"modified":"2021-03-02T09:59:12","modified_gmt":"2021-03-02T05:59:12","slug":"remote-function-call","status":"publish","type":"post","link":"https:\/\/abap-blog.ru\/network\/remote-function-call\/","title":{"rendered":"Remote Function Call"},"content":{"rendered":"<p>Remote Function Call (RFC, удалённый вызов функций) – стандартный интерфейс для обмена данными между SAP и не SAP системами. Интерфейс передачи данных основан на CPI-C или TCP\/IP. Стандартная <a href=\"http:\/\/help.sap.com\/saphelp_nw70\/helpdata\/en\/6f\/1bd5b6a85b11d6b28500508b5d5211\/frameset.htm\" target=\"_blank\" rel=\"noopener\">справка по теме RFC<\/a> или курс BC415.<\/p>\n<p><!--more--><\/p>\n<h3>Особенности RFC функций<\/h3>\n<ul>\n<li>Когда вы вызываете ФМ локально, он работает в том же рабочем процессе что и вызывающая программа. Если вы вызываете ФМ удаленно, он запускается в отдельном рабочем процессе (ЛЕР – LUW, логическая единица работы) если удаленная система является R\/3 системой.<\/li>\n<li>В качестве удаленной системы могут быть R\/3 система, R\/2 система или другая внешняя не SAP система, для не SAP систем существует специальная RFC-SDK библиотека, с помощью которой может быть реализован клиент-сервер для RFC.<\/li>\n<li>При вызове RFC модуля, в программе его вызывающий срабатывает неявный DB Commit (исключение tRFC, qRFC, bgRFC). Поэтому вызовы RFC не должны находиться между OpenSQL операторами.<\/li>\n<li>В интерфейсе ФМ RFC необходимо явно определять тип для каждого параметра, ссылки (LIKE) запрещены.<\/li>\n<\/ul>\n<p>Настроить назначение для RFC вызова можно через транзакцию SM59 (Таблица RFCDES). Подробнее о настройке RFC соединений можно посмотреть в курсе BC415.<\/p>\n<h3>Назначение RFC вызовов<\/h3>\n<p>Назначение RFC вызова определяется с помощью ключевого слова DESTINATION. В качестве параметра может принимать имя удаленной системы, SPACE, NONE, BACK.<\/p>\n<ul>\n<li>SPACE – локальный вызов ФМ (по умолчанию). В случае если не указать DESTINATION в параметрах вызова RFC, функция будет выполнена локально, как обычная без создания своего LUW.<\/li>\n<\/ul>\n<ul>\n<li>NONE – Запуск происходит так же локально, основное отличие в том, что вызов доходит до указанного в настройках шлюза и регистрируется в качестве удаленного вызова. Создается свой DB LUW.<\/li>\n<li>BACK – используется внутри синхронных RFC функций, для запуска RFC функций в той системе которая их вызвала.<\/li>\n<\/ul>\n<p><strong> <\/strong><strong> <\/strong><\/p>\n<h3>Обработка исключений при вызовах RFC<\/h3>\n<p>При вызове RFC модуля могут возникать следующие исключения:<\/p>\n<ul>\n<li>COMMUNICATION_FAILURE – возникает в том случае, когда не настроено соединение для указанной системы в поле DESTINATION, либо когда соединение не могло быть установлено.<\/li>\n<li>SYSTEM_FAILURE – возникает в случае, если на удаленной системе не существует вызываемого модуля, либо в случае других неполадок в RFC вызовах.<\/li>\n<li>RESOURCE_FAILURE – возникает при вызове асинхронных RFC, в случае если нет свободных ресурсов на сервере приложений группы.<\/li>\n<\/ul>\n<div><\/div>\n<h3>Типы RFC функций:<\/h3>\n<ol start=\"1\">\n<li><strong>Синхронные <\/strong><strong>RFC (<\/strong><strong>sRFC)<\/strong> – при вызове sRFC рабочий процесс приостанавливает свою работу, до тех пор, пока не будет выполнен sRFC модуль. Модуль выполняется в отдельном DB LUW.<\/li>\n<\/ol>\n<p>В случае, когда вы вызываете несколько sRFC <strong>подряд<\/strong> из одной группы функций, глобальные данные группы функций будут доступны до тех пор, пока не будет вызвана последняя функция из данной группы.<\/p>\n<p>Если в sRFC внутри себя вызывает CALL SCREEN, CALL TRANSACTION или отображение списка, вызываемые экраны будут отображены в программе запустившей sRFC, но только если в SM59 указан диалоговый удаленный доступ, иначе система выдаст исключение SYSTEM_FAILURE.<\/p>\n<ol start=\"2\">\n<li><strong>Асинхронные <\/strong><strong>RFC вызовы (<\/strong><strong>aRFC)<\/strong> – удаленная функция начинает работать параллельно сразу после её вызова, при этом рабочий процесс не приостанавливает свою работу. Асинхронный вызов срабатывает при вызове ФМ с ключевыми словами: STARTING NEW TASK &lt;ИмяЗадачи&gt;. Модуль выполняется в отдельном DB LUW. aRFC можно так же использовать в фоновом выполнении.<\/li>\n<\/ol>\n<p>Для получения результатов работы aRFC необходимо при вызове указать на процедуру обработки результатов, задается она с помощью ключевого слова: <strong>PERFORMING<\/strong> &lt;ИмяПроцедуры&gt; <strong>ON END OF TASK<\/strong>. Процедура в качестве первого параметра должна содержать переменную, в которую будет записано имя задачи (имя данной переменной не имеет значения). Для получения данных из aRFC, внутри данной процедуры, используется <strong>обязательная <\/strong>команда (если ее не задать в процедуре, система выдаст исключение &#8212; COMMUNICATION_FAILURE): <strong>RECEIVE RESULTS FROM FUNCTION<\/strong> &lt;ИмяARFC&gt;, c параметрами IMPORTING, TABLES, EXCEPTIONS которые будут переданы из aRFC.<\/p>\n<p>Процедура не должна иметь в своем теле операторы, прерывающие выполнение программы, такие как: CALL SCREEN, SUBMIT, COMMIT WORK, WAIT, RFC вызовы, сообщения с типами W и I.<\/p>\n<p>Для ожидания выполнения aRFC вызовов существует ключевое слово WAIT UNTIL &lt;Условие&gt;. Если после вызова aRFC условие выполняется, программа сразу же начинает свое выполнение после WAIT UNTIL. В случае если не выполняется, программа снова проверяет условие. Данный процесс повторяется до тех пор, пока условие не будет выполнено или не будут выполнены все aRFC вызовы.<\/p>\n<p>Пример программы запускающей 2 aRFC функции и ожидающей выполнение обоих:<\/p>\n<pre class=\"lang:abap decode:true\">REPORT zaRFC_demo.\r\n\r\nDATA:\r\n  lv_flag1, lv_flag2.\r\n\r\nCALL FUNCTION 'Z_PAR_TEST'\r\n  STARTING NEW TASK 'TASK1'\r\n  PERFORMING receive_results_from_rfc ON END OF TASK\r\n  EXPORTING\r\n    COUNT           = 2.\r\n\r\nCALL FUNCTION 'Z_PAR_TEST'\r\n  STARTING NEW TASK 'TASK2'\r\n  PERFORMING receive_results_from_rfc ON END OF TASK\r\n  EXPORTING\r\n    COUNT           = 2.\r\n\r\nWAIT UNTIL lv_flag1 = abap_true AND lv_flag2 = abap_true.\r\nIF sy-subrc = 0.\r\n  WRITE 'Все aRFC выполнены успешно'.\r\nELSE.\r\n  WRITE 'Все aRFC закончены, однако условие не выполнено'.\r\nENDIF.\r\n\r\nFORM receive_results_from_rfc USING taskname.\r\n  CASE taskname.\r\n    WHEN 'TASK1'. lv_flag1 = abap_true.\r\n    WHEN 'TASK2'. lv_flag2 = abap_true.\r\n  ENDCASE.\r\n  \" Обязательно необходимо вызвать получение результата работы aRFC\r\n  RECEIVE RESULTS FROM FUNCTION 'Z_PAR_TEST'.\r\nENDFORM.\r\nFUNCTION Z_PAR_TEST.\r\n*\"----------------------------------------------------------------------\r\n*\"*\"Локальный интерфейс:\r\n*\" IMPORTING\r\n*\" VALUE(COUNT) TYPE I\r\n*\" EXPORTING\r\n*\" VALUE(INDEX) TYPE I\r\n*\"----------------------------------------------------------------------\r\n\r\n  DATA: tmp TYPE float.\r\n\r\n  DO 5000000 TIMES.\r\n    tmp = tmp * 2.  \" Умножение 0 на 2 очень длительная операция ;)\r\n  ENDDO.\r\n\r\n  INDEX = tmp.\r\n\r\nENDFUNCTION.<\/pre>\n<p>Если в качестве имени задачи в вызове aRFC указать TASK3, условия выполнены не будут.<\/p>\n<p>aRFC вызовы могут вызываться в одной SAP системе, но на разных серверах приложений, тем самым распределяя нагрузку между ними. Для распределения aRFC вызовов между серверами приложений служат так называемые RFC группы (тр. SM59). Для определения в какой именно группе вызывать aRFC служит ключевое слово – <strong>DESTINATION IN GROUP<\/strong> &lt;ИмяГруппы&gt;.  Если в качестве имени группы указать DEFAULT, вызов будет происходить на любой из определенных групп, в зависимости от их загруженности, если все группы будут заняты, система выдаст исключение – RESOURCE_FAILURE.<\/p>\n<p><a href=\"http:\/\/help.sap.com\/saphelp_nwpi71\/helpdata\/en\/fa\/096e92543b11d1898e0000e8322d00\/frameset.htm\" target=\"_blank\" rel=\"noopener\">SAP Help на тему распараллеливания.<\/a><\/p>\n<p>Пример распараллеливания вычислений с помощью групп:<\/p>\n<pre class=\"lang:abap decode:true\">REPORT  ztst_call_async_rfc.\r\n\r\nPARAMETERS: p_para TYPE char1 DEFAULT 'X' AS CHECKBOX.\r\n\r\nTYPES: BEGIN OF t_tasklist,\r\n         taskname(4) TYPE C,        \" Задача\r\n         RESULT      TYPE char50,   \" Статус обработки\r\n      END OF t_tasklist.\r\n\r\nDATA:\r\n      lv_calls TYPE I VALUE 10,               \" Количество запусков функции\r\n      lv_max_tasks TYPE I,                    \" Переменная для хранения максимального числа задач\r\n      lv_free_tasks TYPE I,                   \" Переменная для хранения числа свободных задач\r\n      lv_number_of_tasks_in_use TYPE I,       \" Количество задач в работе\r\n      lv_started_rfc_calls TYPE I VALUE 0,    \" Кол-во запущенных задач\r\n      lv_finished_rfc_calls TYPE I VALUE 0,   \" Кол-во завершенных задач\r\n      lv_exception_flag(1) TYPE C,            \" Флаг ошибки запуска задачи из-за нехватки ресурсов\r\n      lv_taskname(4) TYPE N VALUE '0001',     \" Имя задачи\r\n      lt_tasklist TYPE TABLE OF t_tasklist.   \" Журнал обработки RFC вызовов.\r\n\r\nDATA: \" Для обработки времени работы\r\n      lv_start_time TYPE timestampl,\r\n      lv_end_time   TYPE timestampl,\r\n      lv_diff       TYPE timestampl.\r\n\r\nFIELD-SYMBOLS: &lt;fs_tasklist&gt; TYPE t_tasklist.\r\n\r\nSTART-OF-SELECTION.\r\n  IF p_para EQ 'X'.\r\n    GET TIME STAMP FIELD lv_start_time.\r\n* Получение максимального числа задач и кол-во свободных для использования задач.\r\n    CALL FUNCTION 'SPBT_INITIALIZE'\r\n      EXPORTING\r\n        group_name                     = ''\r\n      IMPORTING\r\n        max_pbt_wps                    = lv_max_tasks\r\n        free_pbt_wps                   = lv_free_tasks\r\n      EXCEPTIONS\r\n        invalid_group_name             = 1\r\n        internal_error                 = 2\r\n        pbt_env_already_initialized    = 3\r\n        currently_no_resources_avail   = 4\r\n        no_pbt_resources_found         = 5\r\n        cant_init_different_pbt_groups = 6\r\n        OTHERS                         = 7.\r\n\r\n    IF sy-subrc &lt;&gt; 0.\r\n      MESSAGE ID sy-msgid TYPE sy-msgty NUMBER sy-msgno\r\n              WITH sy-msgv1 sy-msgv2 sy-msgv3 sy-msgv4.\r\n    ELSE.\r\n      WRITE : \/ 'Макисмальное число задач для выполнения параллельно обработки: ', 80 lv_max_tasks RIGHT-JUSTIFIED.\r\n      WRITE : \/ 'Доступное кол-во задач: ', 50 lv_free_tasks RIGHT-JUSTIFIED.\r\n      ULINE.\r\n\r\n      DO lv_calls TIMES.\r\n        PERFORM call_rfc. \" Запуск RFC задачи\r\n        \" call_rfc - запускает на выполнение RFC функцию в отдельном задаче (асинхронно),\r\n        \" в случае если нет свободных задач, или произошла ошибка выделения задачи,\r\n        \" ожидает пока не завершаться предыдущие задачи, после завершения продолжает данный цикл.\r\n      ENDDO.\r\n      \" Последняя задержка пока не отработают все \"последние\" задачи.\r\n      WAIT UNTIL lv_finished_rfc_calls = lv_calls.\r\n\r\n      SKIP 2.\r\n      WRITE : \/ 'Журнал работы RFC функций:'.\r\n      ULINE.\r\n      LOOP AT lt_tasklist ASSIGNING &lt;fs_tasklist&gt;.\r\n        WRITE : \/ &lt;fs_tasklist&gt;-taskname,\r\n                  &lt;fs_tasklist&gt;-RESULT.\r\n      ENDLOOP.\r\n\r\n      SKIP.\r\n      GET TIME STAMP FIELD lv_end_time.\r\n      lv_diff = lv_end_time - lv_start_time.\r\n      WRITE: \/(50) 'Время работы', lv_diff.\r\n    ENDIF.\r\n  ELSE.\r\n    GET TIME STAMP FIELD lv_start_time.\r\n    \" Запуск функции в последовательной обработке\r\n    DO lv_calls TIMES.\r\n      CALL FUNCTION 'Z_PAR_TEST'\r\n        EXPORTING\r\n          COUNT  = 2\r\n        EXCEPTIONS\r\n          OTHERS = 99.\r\n    ENDDO.\r\n    GET TIME STAMP FIELD lv_end_time.\r\n    lv_diff = lv_end_time - lv_start_time.\r\n    WRITE: \/(50) 'Время работы', lv_diff.\r\n\r\n  ENDIF.\r\n\r\n*&amp;---------------------------------------------------------------------*\r\n*&amp; Form call_rfc\r\n*&amp;---------------------------------------------------------------------*\r\n* text\r\n*----------------------------------------------------------------------*\r\nFORM call_rfc.\r\n\r\n  ADD 1 TO lv_number_of_tasks_in_use.\r\n\r\n* Внимание: количество свободных задач для параллельной обработки делится между всеми\r\n* пользователями, крайне не желательно использовать все (lv_free_tasks) для расчётов,\r\n* их количество настраивается в тр. RZ12. В случае если все свободные задачи заняты кем\r\n* то, программа выдаст сообщение об ошибке (Нехватке ресурсов ПФЗ), после вызова SPBT_INITIALIZE\r\n\r\n  \" Если количество процессов в работе будет превышать кол-во свободных задач,\r\n  \" остановим программу на ожидание освобождения задач.\r\n  IF lv_number_of_tasks_in_use &gt; lv_free_tasks.\r\n    WRITE : \/ 'Ожидаем пока завершатся предыдущие задачи'.\r\n    WAIT UNTIL lv_number_of_tasks_in_use &lt; lv_free_tasks.\r\n  ENDIF.\r\n  CALL FUNCTION 'Z_PAR_TEST'\r\n    STARTING NEW TASK lv_taskname\r\n    \"DESTINATION IN GROUP DEFAULT\r\n    PERFORMING receive_results_from_rfc ON END OF TASK\r\n    EXPORTING\r\n      COUNT           = 2\r\n* Так как используется асинхронный вызов RFC параметры импорта здесь не указываются,\r\n* результат работы будет получаен в форме receive...\r\n    EXCEPTIONS\r\n      communication_failure = 1\r\n      system_failure        = 2\r\n      resource_failure      = 3.\r\n\r\n* Чтобы узнать на каком сервере приложений будет запущена задача, необходимо сразу после запуска\r\n* воспользоваться ФМ - SPBT_GET_PP_DESTINATION\r\n* Чтобы исключить выполнение задачи на полученном сервере приложений используется ФМ: SPBT_DO_NOT_USE_SERVER\r\n*\r\n* Администрирование групп параллельной обработки выполняется через транзакцию - RZ12\r\n* Мануал по этому делу тут: http:\/\/help.sap.com\/saphelp_nw04\/helpdata\/en\/fa\/096e92543b11d1898e0000e8322d00\/frameset.htm\r\n* Пример обработки:\r\n** 1 - system crash occured on the receiving side\r\n** 2 - connection or communication problem with RFC-Destination\r\n* CALL FUNCTION 'SPBT_GET_PP_DESTINATION'\r\n* IMPORTING rfcdest = lf_rfcdest.\r\n*\r\n* CALL FUNCTION 'SPBT_DO_NOT_USE_SERVER'\r\n* EXPORTING server_name = lf_server\r\n* EXCEPTIONS\r\n* invalid_server_name = 1\r\n* no_more_resources_left = 2\r\n* pbt_env_not_initialized_yet = 3\r\n* OTHERS = 4.\r\n* IF sy-subrc &lt;&gt; 0.\r\n* cf_task_failure = chars. \"e-message -&gt; missing log\r\n* EXIT.\r\n* ENDIF.\r\n\r\n  CASE sy-subrc.\r\n\r\n    WHEN 0.\r\n      WRITE : \/ 'Запущена новая задача с именем: ', lv_taskname.\r\n\r\n      APPEND INITIAL LINE TO lt_tasklist ASSIGNING &lt;fs_tasklist&gt;.\r\n      &lt;fs_tasklist&gt;-taskname = lv_taskname.\r\n\r\n      lv_started_rfc_calls = lv_started_rfc_calls + 1.\r\n      ADD 1 TO lv_taskname.\r\n\r\n    WHEN 1 OR 2.           \"Communications failure\r\n* Означает что сервер приложений не доступен; нет необходимости обрабатывать данное исключение,\r\n    WHEN 3.                \" Нет свободных задач, ожидаем.\r\n      IF lv_exception_flag = SPACE.\r\n        lv_exception_flag = 'X'.\r\n        WRITE : \/ 'Нет доступных задач ждем пока освободятся...'.\r\n        WAIT UNTIL lv_finished_rfc_calls &gt;= lv_started_rfc_calls.\r\n      ELSE.\r\n        WRITE : \/ 'Повторное ожидание освобождения задач...'.\r\n        WAIT UNTIL lv_finished_rfc_calls &gt;= lv_started_rfc_calls.\r\n\r\n        IF sy-subrc = 0.   \" Ожидание было успешным\r\n          CLEAR lv_exception_flag.\r\n        ELSE.              \" Ожидание прервано, сбой в RFC вызове, прерывание обработки\r\n          WRITE : \/ 'RFC вызов прерван'.\r\n          EXIT.\r\n        ENDIF.\r\n      ENDIF.\r\n  ENDCASE.\r\n\r\nENDFORM.                    \"call_rfc\r\n\r\n*&amp;---------------------------------------------------------------------*\r\n*&amp; Form receive_results_from_rfc\r\n*&amp;---------------------------------------------------------------------*\r\n* text\r\n*----------------------------------------------------------------------*\r\n* --&gt;VALUE(P_TASKNAME) text\r\n*----------------------------------------------------------------------*\r\nFORM receive_results_from_rfc USING VALUE(p_taskname).\r\n  lv_number_of_tasks_in_use = lv_number_of_tasks_in_use - 1.\r\n\r\n* Обновить статус задачи\r\n  READ TABLE lt_tasklist WITH KEY taskname = p_taskname ASSIGNING &lt;fs_tasklist&gt;.\r\n  IF sy-subrc = 0.\r\n    &lt;fs_tasklist&gt;-RESULT = 'Задача успешно завершена'.\r\n  ELSE.\r\n    READ TABLE lt_tasklist WITH KEY taskname = lv_taskname ASSIGNING &lt;fs_tasklist&gt;.\r\n    IF sy-subrc = 0.\r\n      &lt;fs_tasklist&gt;-RESULT = 'Ошибка в обработке задачи'.\r\n    ENDIF.\r\n  ENDIF.\r\n\r\n* Получение результатов обработки функции, в данном случае ничего не получаем\r\n  RECEIVE RESULTS FROM FUNCTION 'Z_PAR_TEST'.\r\n\r\n  lv_finished_rfc_calls = lv_finished_rfc_calls + 1.\r\nENDFORM.                    \"RECEIVE_RESULTS_FROM_RFC<\/pre>\n<p>aRFC вызовы так же как и sRFC могут вызывать внутри себя диалоги, но их использование в данном контексте выглядит сомнительно, более подробно рассмотрено в курсе (BC415).<\/p>\n<ol start=\"1\">\n<li><strong>Транзакционные <\/strong><strong>RFC (<\/strong><strong>tRFC)<\/strong> – асинхронные и синхронные вызовы RFC отрабатывают каждый в своем DB LUW (ЛЕР), транзакционные RFC срабатывают в одном DB LUW, тем самым позволяют группировать их вызовы с возможностью отката в случае ошибок в одном из tRFC вызове. Запуск tRFC осуществляется с помощью ключевого слова IN BACKGROUND TASK. Программа, запустившая tRFC, не приостанавливает свою работу, вызов tRFC происходит тогда, когда программа вызовет COMMIT WORK. В момент вызова tRFC не происходит вызова неявного DB COMMIT. tRFC, так же как и aRFC вызываются асинхронно, однако получить результат работы этих функций как в aRFC невозможно. Для просмотра созданных tRFC-LUW служит транзакция SM58.<\/li>\n<\/ol>\n<p>Все tRFC вызовы сохраняются в таблицах: ARFCSSTATE и ARFCSDATA. Если вы не хотите вызывать tRFC немедленно после COMMIT WORK, вы можете вызвать ФМ START_OF_BACKGROUNDTASK (<strong>до <\/strong><strong>COMMIT<\/strong><strong>WORK<\/strong>) и задать время и дату запуска для накопленных tRFC вызовов.<\/p>\n<p>После выполнения COMMIT WORK в случае успешного локального обновления (в рамках LUW основной программы),  накопленные данные создают фоновую задачу, в случае успешного выполнения этой задачи все данные из таблиц tRFC удаляются. Если задача не была выполнена, срабатывает механизм повтора или отката.<\/p>\n<p>Так, например если связь с удаленной системой не была установлена, срабатывает автоматический повтор выполнения задания. По умолчанию количество повторов равно 30, интервал ожидания равен 15 минутам.<\/p>\n<p>В случае если во втором из двух tRFC вызовов произошел сбой, сообщение с типом A или X или вызов исключения через RAISE после успешного выполнения первого происходит следующее:<\/p>\n<ul>\n<li>Все изменения сделанные в текущем LUW (а он один на все tRFC) откатываются<\/li>\n<li>Происходит запись в журнал вызова tRFC (тр. SM58)<\/li>\n<\/ul>\n<p>Для принудительного отката всех изменений или отмены tRFC-LUW служит ФМ &#8212; RESTART_OF_BACKGROUNDTASK.<\/p>\n<p>В случае если вызовы tRFC происходят на разных системах (DESTINATION ‘A’, DESTIONATION ‘B’), для каждой из них создается свой tRFC-LUW, вызовы tRFC группируются в зависимости от назначения.<\/p>\n<p>Для вызова tRFC отдельно от остальных можно воспользоваться ключевым словом: AS SEPARATE UNIT.<\/p>\n<p>Каждый tRFC-LUW имеет свой уникальный ID, для его получения можно использовать ФМ: ID_OF_BACKGROUNDTASK (вызывать перед COMMIT WORK). Используя данный ID можно определить статус для tRFC-LUW через ФМ &#8212; STATUS_OF_BACKGROUNDTASK.<\/p>\n<ol start=\"2\">\n<li><strong>qRFC – <\/strong><strong>RFC функции выполняемые в порядке очереди.<\/strong> При использовании tRFC мы не можем контролировать порядок запуска tRFC модулей, другими словами порядок их вызова может не соответствовать порядку их запуска. qRFC в отличие от tRFC, позволяют нам контролировать порядок их запуска.<\/li>\n<\/ol>\n<p>Для размещения tRFC вызовов в порядке FIFO (первый пришел, первый вышел) необходимо перед каждым tRFC вызовом указывать имя очереди, делается это с помощью ФМ: TRFC_SET_QUEUE_NAME:<\/p>\n<pre class=\"lang:abap decode:true\">CALL FUNCTION 'TRFC_SET_QUEUE_NAME' EXPORTING  qname = 'Q1'.\r\nCALL FUNCTION 'A1' IN BACKGROUND TASK.\r\n\r\nCALL FUNCTION 'TRFC_SET_QUEUE_NAME' EXPORTING  qname = 'Q1'.\r\nCALL FUNCTION 'A2' IN BACKGROUND TASK.\r\n\r\nCOMMIT WORK.\r\n\r\nCALL FUNCTION 'TRFC_SET_QUEUE_NAME' EXPORTING  qname = 'Q1'.\r\nCALL FUNCTION 'B1' IN BACKGROUND TASK.\r\n\r\nCALL FUNCTION 'TRFC_SET_QUEUE_NAME' EXPORTING  qname = 'Q1'.\r\nCALL FUNCTION 'B2' IN BACKGROUND TASK.<\/pre>\n<p>Имя очереди может содержать 24 символа, исключая % и *.<\/p>\n<p>Для администрирования qRFC вместо транзакции SM58 используется транзакция &#8212; SMQ1. Таблица, в которой хранятся данные qRFC &#8212; TRFCQOUT.<\/p>\n<ol start=\"1\">\n<li><strong>Фоновые <\/strong><strong>RFC<\/strong><strong> (<\/strong><strong>bgRFC<\/strong><strong>). <\/strong>SAP рекомендует использовать их вместо tRFC и qRFC для лучшей производительности. bgRFC, в отличие от tRFC и qRFC, позволяют приложениям записывать данные полученные позже от вызванных программ. Кроме того можно организовывать зависимые последовательности вызовов, так например вызов создающий входящую поставку будет выполнен только после выполнения вызова создающего закупочный заказ. bgRFC вызываются с помощью ключевого слова IN BACKGROUND UNIT &lt;oref&gt;, где &lt;oref&gt; &#8212; ссылка на класс реализующий интерфейс IF_BGRFC_UNIT.<\/li>\n<\/ol>\n<p>Более подробная информация о bgRFC находится <a href=\"http:\/\/help.sap.com\/saphelp_nw73ehp1\/helpdata\/EN\/48\/927c2caa6b17cee10000000a421937\/frameset.htm\" target=\"_blank\" rel=\"noopener\">тут<\/a>.<\/p>\n<h3>Транзакции, используемые при работе с RFC<\/h3>\n<ul>\n<li>ST22 – просмотр дампов, вызываемых RFC<\/li>\n<li>SMGW – монитор шлюза RFC подключений<\/li>\n<li>Журналы работы: на стороне вызовов – ST05, на стороне вызываемой системы SM59, на стороне шлюза – SMGW<\/li>\n<\/ul>\n<h3>BAPI функции<\/h3>\n<p>Для обмена бизнес данными, между SAP и не SAP системами, был создан так называемый Business Framework. Центральной его частью является хранилище бизнес объектов (BOR – Business Object Repository). Каждый бизнес объект обеспечивает объектно-ориентированный подход к хранению бизнес данных и работы с бизнес процессами. Например, вызывая методы бизнес объектов, мы тем самым манипулируем бизнес данными, за которые он отвечает, не заботясь о техническом вопросе (связях в таблицах и т.п.)<\/p>\n<p>Бизнес объект состоит из следующих частей:<\/p>\n<ul>\n<li>Технические данные – внутренний номер, номер релиза SAP системы, с которой он доступен и т.п.<\/li>\n<li>Список интерфейсов, которые поддерживает объект – интерфейс определяет поведенческую структуру объекта<\/li>\n<li>Ключевые поля – атрибуты, которые однозначно идентифицируют объект. (Номер закупочного заказа)<\/li>\n<li>Атрибуты – могут быть как поля из базы данных, так и рассчитываемые во время работы с объектом (виртуальные), ссылки на другие объекты (Бизнес объект «Заказ на закупку» например, может иметь ссылки на объекты входящих поставок)<\/li>\n<li>Методы – представляют собой вызовы R\/3 транзакций, функциональных модулей или другого ABAP кода. BAPI как раз и представляют собой реализацию методов бизнес объектов.<\/li>\n<li>События – используются в основном в Workflow. Например, сделать рассылку поставщикам при создании закупочного заказа.<\/li>\n<\/ul>\n<p>BAPI – реализация метода бизнес объекта, представляет собой функциональный модуль RFC. BAPI могут вызываться как синхронно (COMMIT WORK <strong>AND <\/strong><strong>WAIT<\/strong>), так и асинхронно т.е. ожидая выполнения работы функции или нет.<\/p>\n<p>BAPI могут представлять различные действия над объектом:<\/p>\n<ul>\n<li>Создание объекта<\/li>\n<li>Запрос атрибутов объекта<\/li>\n<li>Изменение атрибутов объекта<\/li>\n<\/ul>\n<p>BAPI могут вызываться из различных приложений: офисных приложений (через VBA), JAVA и С++ программ и т.п.<\/p>\n<p>Все BAPI после своей работы возвращают результат в виде внутренней таблицы с одной из структур: BAPIRETURN, BAPIRETURN1, BAPIRET1, BAPIRET2, BAPIRET1_FIX. В связи с этим в BAPI нет обработки исключений как в стандартных ФМ. Все эти структуры содержат в себе следующие поля:<\/p>\n<ul>\n<li>TYPE – тип сообщения: S(uccess), E(rror), W(arning), I(nformation)<\/li>\n<li>ID (класс сообщений)<\/li>\n<li>NUMBER (номер сообщения в классе)<\/li>\n<li>MESSAGE (текст сообщения)<\/li>\n<li>MESSAGE_V1, MESSAGE_V2, MESSAGE_V3, MESSAGE_V4 (переменные сообщений)<\/li>\n<\/ul>\n<p>Если транзакция выполнена успешно, то в таблице RETURN не будет существовать записей с типом ошибки «Е». Должно присутствовать сообщение с типом ошибки «S».<\/p>\n<p>Обновление в BAPI всегда происходит в IN UPDATE TASK (см. документацию по ключевому слову IN UPDATE TASK или курс по обновлению БД – BC414). Внутри BAPI никогда не вызывается COMMIT WORK. Для подтверждения или отката LUW всегда должны использоваться ФМ: BAPI_TRANSCATION_COMMIT, BAPI_TRANSACTION_ROLLBACK, разница между данными ФМ и COMMIT WORK (ROLLBACK WORK) в том что они чистят внутренние переменные используемые при вызовах BAPI, если этого не делать могут возникать проблемы при повторном вызове BAPI. Все BAPI вызванные в программе до вызова BAPI_TRANSCATION_COMMIT (BAPI_TRANSCATION_ROLLBACK) вызываются в одном LUW. Для просмотра всех имеющихся в системе BAPI служит транзакция BAPI (запускает BAPI EXPLORER).<\/p>\n<p>Курс, в котором рассматривается создание собственных BAPI &#8212; BC417.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Remote Function Call (RFC, удалённый вызов функций) – стандартный интерфейс для обмена данными между SAP и не SAP системами. Интерфейс передачи данных основан на CPI-C или TCP\/IP. Стандартная справка по теме RFC или курс BC415.<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[310],"tags":[144,82,146,150,149,147,148,18,151,145],"_links":{"self":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/621"}],"collection":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/comments?post=621"}],"version-history":[{"count":7,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/621\/revisions"}],"predecessor-version":[{"id":6472,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/posts\/621\/revisions\/6472"}],"wp:attachment":[{"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/media?parent=621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/categories?post=621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/abap-blog.ru\/wp-json\/wp\/v2\/tags?post=621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}